Attribute VB_Name = "MBD030_借入金時価評価"
'
Option Explicit
'
Private Const pPROGRAM_ID As String = "MBD030_借入金時価評価"

'------------------------------------------------
' MBD030_借入金テーブル作成
'------------------------------------------------
Public Function MBD030_借入金テーブル作成(p金融リストラ As String, p借入金マスタ As MAA910_借入金, _
                                        Optional pClear As Boolean = True) As Double
'
    Dim j As Integer

    Dim wTable As MAA910_借入金テーブル
    
    Dim w解約保証料戻

    Dim w銀行マスタ As MAA030_銀行

    Dim w実行支払年月 As Date
    Dim w支払日 As Integer
    Dim w返済予定年月 As Date
    Dim w実際年月日 As Date
    Dim wRecCount As Integer
    
    Dim w実行解約年月 As Date
    
    'Dim w融資残高 As Double
    
    Dim wCount As Integer
    Dim wSm解約実行日 As Date
    Dim w実際予定年月日 As Date
    Dim wRet保証料算出 As MBD010_保証料算出リターン
    
    'Dim w解約実行日 As Variant
    Dim w解約年月 As Variant                    ' 08/07/20 V188
    Dim w年月日 As Date
    
    Dim w返済単位判定 As Long
    Dim w返済単位回数 As Integer
    
    Dim w据置回数 As Integer
    
    Dim wp日数 As Integer
    Dim wd01 As Date
    Dim w調整月数 As Integer    'V180 07/02/01
    Dim w日割日数   As Integer        ' 07/03/23 V180
    Dim w利息対象期間日数   As Integer      'V182 2008/01/28
    Dim OLD実際年月日 As Variant    ' 07/03/24 V180
    Dim NEW実際年月日 As Variant    ' 07/03/24 V180
    Dim w差月数 As Integer          ' 07/03/24 V180
    
    Dim w一括支払利息開始年月 As Date           '08/03/14 V185
    Dim wGAP As Integer                         '08/03/14 V185
    Dim w初回利息F As Integer                   '08/03/14 V185
    Dim w有効F As Integer                       '08/03/14 V185
    
    Dim sv支払回数 As Integer                   ' 08/07/19 V188
    Dim w調整解約年月 As Date                   ' 08/07/20 V188
    Dim wyy As Integer                          ' 08/07/20 V188
    Dim wmm As Integer                          ' 08/07/20 V188
    Dim wdd As Integer                          ' 08/07/20 V188
    
    Dim w本日年月日 As Date                     ' 08/12/06 V189
    Dim w利息計算基準年月日 As Date             ' 08/12/10 V189
    Dim w実行日 As Date                         '10/01/21
    
    Dim wx As Integer                           '10/02/05
    Dim wY As Integer                           '10/02/05
    Dim wZ As Integer                           '10/02/05
    Dim wW As Integer                           '10/02/05
'
    On Error GoTo MBD030_借入金テーブル作成_ERR
'
    w本日年月日 = Date                          ' 08/12/06 V189
    
    wp日数 = 0
    
        
    '*********
    '*
    '*           w解約実行日　セット
    '*
    '*********
    w解約実行日 = Null
    If w解約無効F = 0 Then                      '10/01/24
        If p金融リストラ <> "" And p金融リストラ = p借入金マスタ.金融リストラ番号 Then
            w解約実行日 = p借入金マスタ.金融解約実行日
            w解約年月 = p借入金マスタ.金融解約年月              ' 08/07/20 V188
        Else
            If Not IsNull(p借入金マスタ.解約実行日) Then
                w解約実行日 = p借入金マスタ.解約実行日
                w解約年月 = p借入金マスタ.解約年月              ' 08/07/20 V188
            End If
        End If
    End If                                                      '10/01/24
    
    w銀行マスタ = MAA030_銀行マスタRead(p借入金マスタ.銀行番号)
    
    
    
    '実行支払年月 の　算出      10/01/21
    w実行支払年月 = MBD010_実行日支払年月算出(p借入金マスタ.実行日, p借入金マスタ.営業日区分, _
                                           p借入金マスタ.支払日)
    '**********
    '*
    '*           据置回数&支払回数　再セット
    '*
    '**********
    p借入金マスタ.据置回数 = DateDiff("m", w実行支払年月, p借入金マスタ.初回返済年月)
    w据置回数 = p借入金マスタ.据置回数
    p借入金マスタ.支払回数 = DateDiff("m", p借入金マスタ.初回返済年月, _
                                           p借入金マスタ.最終返済年月) + 1
                                           
    sv支払回数 = p借入金マスタ.支払回数             ' 08/07/19 V188  解約無い時の支払回数
    
                                           
    '***V188にて INPUT時　で入力する  08/07/07
    'wd01 = MXA030_翌営業年月日計算(CDate(p借入金マスタ.最終返済年月), p借入金マスタ.支払日, p借入金マスタ.営業日区分) ' 07/01/30 V180
    'p借入金マスタ.最終返済実行日 = Format(wd01, "yyyy/mm/dd") 'V180 07/01/21
                                                           
    If Not IsNull(w解約実行日) Then
    
        w実行解約年月 = MBD010_実行解約年月(w解約実行日, _
                               p借入金マスタ.初回返済年月, p借入金マスタ.初回返済実行日, _
                               p借入金マスタ.最終返済年月, p借入金マスタ.最終返済実行日, _
                               p借入金マスタ.支払日, p借入金マスタ.営業日区分)      ' 08/07/24 V188
        
        '据置期間の解約
        If w解約実行日 <= p借入金マスタ.初回返済実行日 Then
            
            w据置回数 = DateDiff("m", w実行支払年月, w実行解約年月) + 1
            p借入金マスタ.支払回数 = 0
        '据置期間後の解約
        Else
           
            p借入金マスタ.支払回数 = DateDiff("m", p借入金マスタ.初回返済年月, w実行解約年月) + 1
        End If
            
    End If
    
    
    '解約の時　支払回数　据置回数　異常を正常に戻す
    If w据置回数 > p借入金マスタ.据置回数 Then      ' 08/07/21 V188
        w据置回数 = p借入金マスタ.据置回数          ' 08/07/21 V188
        p借入金マスタ.支払回数 = 1                  ' 08/07/21 V188
    End If                                          ' 08/07/21 V188
    
    If p借入金マスタ.支払回数 > sv支払回数 Then     ' 08/07/21 V188
        p借入金マスタ.支払回数 = sv支払回数         ' 08/07/21 V188
    End If                                          ' 08/07/21 V188
    
    ' =========================================
    '         グローバルテーブル　クリア
    ' =========================================
    If pClear Then
        ReDim G借入金テーブル(0)
    End If
    
    If p借入金マスタ.実行日 = p借入金マスタ.初回返済実行日 Then     '10/05/06 V195
        If p借入金マスタ.利息支払方法 = 1 Then                          '10/05/06 V195
            p借入金マスタ.金利初回年月 = DateAdd("M", p借入金マスタ.返済単位月数 - 1, w実行支払年月) '10/05/06 V195
        Else                                                            '10/05/06 V195
            p借入金マスタ.金利初回年月 = w実行支払年月                  '10/05/06 V195
        End If                                                          '10/05/06 V195
    Else                                                                '10/05/06 V195
        p借入金マスタ.金利初回年月 = Format(p借入金マスタ.金利初回年月, "yyyy/mm/01") '09/12/22
    End If                                                              '10/05/06 V195
    
    
    '***金利初回年月<=w実行支払年月 10/01/17
    If Format(p借入金マスタ.金利初回年月, "yyyy/mm/dd") <= Format(w実行支払年月, "yyyy/mm/dd") Then '10/01/17
        p借入金マスタ.金利初回年月 = w実行支払年月                      '10/01/17
    End If                                                              '10/01/17
    
    If p借入金マスタ.手入力区分 = P8.FCDbl(XMXA020_区分("登録方法", "標準登録")) Then
        w一括支払利息開始年月 = p借入金マスタ.金利初回年月              ' 2009/12/22
    Else
        w一括支払利息開始年月 = p借入金マスタ.初回返済年月              ' 2009/12/22
    End If

    
    ' *****************************************
    ' *
    ' *          借入金テーブル セット
    ' *
    ' *****************************************
    ' -----------------------------------------
    '            実行日のＤＡＴＡ
    ' -----------------------------------------
    
  If p借入金マスタ.実行日 <> p借入金マスタ.初回返済実行日 Then  '10/05/06 V195
    
    w内入開始年月日 = Null                   ' 08/12/05 V189
    w内入終了年月日 = Null                   ' 08/12/05 V189
    w融資残高 = p借入金マスタ.融資金額       ' 08/12/05 V189
    
    
    wTable.借入番号 = p借入金マスタ.借入番号
    wTable.返済回数 = 0
    wTable.据置x回目 = 2                   ' 08/12/06 V189 借入明細出力順で使用
    wTable.返済予定年月 = C年月日.GetDate("月始", p借入金マスタ.実行日)
    
    
    
    wTable = MBD010_借入金テーブルRead(wTable)
        
        wTable.実際年月日 = p借入金マスタ.実行日
        OLD実際年月日 = wTable.実際年月日           ' 07/03/24 V180
        NEW実際年月日 = wTable.実際年月日           ' 07/03/24 V180
        wTable.元金額 = 0
        wTable.保証料 = 0
        wTable.融資残高 = p借入金マスタ.融資金額
        wTable.利率 = p借入金マスタ.利率
        
        '***** 返済単位月数＝１　は　利息支払方法　０（毎月）をセット
        If p借入金マスタ.返済単位月数 = 1 Then  '2009/12/20
            p借入金マスタ.利息支払方法 = 0      '2009/12/20
        End If                                  '2009/12/20
        
    
        If p借入金マスタ.利息区分 = XMXA020_区分("利息区分", "利息先払") Then
          '利息先払
          If p借入金マスタ.利息支払方法 = 0 Then                                    ' 07 01/31 V180
            '利息毎月支払
            GDate1 = MBD010_利息計算年月日(p借入金マスタ.金利初回年月, p借入金マスタ.支払日, _
                     p借入金マスタ.営業日区分, p借入金マスタ.利息計算日数区分)  ' 07/01/30 V180
                     
            If Format(p借入金マスタ.金利初回年月, "yyyy/mm/dd") = Format(p借入金マスタ.初回返済年月, "yyyy/mm/dd") Then   '10/01/01
                If Format(GDate利息対象年月日, "yyyy/mm/dd") <> Format(p借入金マスタ.初回返済実行日, "yyyy/mm/dd") Then  ' 08/12/21 V189
                    GDate1 = p借入金マスタ.初回返済実行日                       ' 08/07/19 V188
                    GDate利息対象年月日 = p借入金マスタ.初回返済実行日          ' 08/07/19 V188
                End If                                                          ' 08/07/22 V188
            End If                                                          ' 08/07/19 V188
            
            wTable.日割日数 = DateDiff("d", p借入金マスタ.実行日, GDate1) + 1
            w内入開始年月日 = p借入金マスタ.実行日          ' 08/12/05 V189
            w内入終了年月日 = GDate1                        ' 08/12/05 V189
            
            
            GDate1利息対象年月日 = GDate利息対象年月日      'V182 2008/02/28
            wTable.利息対象期間日数 = wTable.日割日数      '09/12/29
            w利息対象内入開始年月日 = p借入金マスタ.実行日          ' 08/12/08 V189
            w利息対象内入終了年月日 = GDate1利息対象年月日          ' 08/12/08 V189
            
            If p借入金マスタ.利息控除区分 = 1 Or p借入金マスタ.利息控除区分 = 3 Then  ' 07/03/05 V180
                wTable.日割日数 = wTable.日割日数 - 1                                 ' 07/03/05 V180
            End If                                                                    ' 07/03/05 V180
            
            If Format(p借入金マスタ.金利初回年月, "yyyy/mm/dd") = _
               Format(p借入金マスタ.初回返済年月, "yyyy/mm/dd") _
               And Format(p借入金マスタ.初回返済年月, "yyyy/mm/dd") = _
                   Format(p借入金マスタ.最終返済年月, "yyyy/mm/dd") _
               And (p借入金マスタ.利息控除区分 = 2 Or p借入金マスタ.利息控除区分 = 3) Then  '09/12/31
                    wTable.日割日数 = wTable.日割日数 - 1               '09/12/31
            End If                                                  '09/12/31

            
            wTable.利息額 = MBD010_利息計算小数点5桁(p借入金マスタ.利率, p借入金マスタ.融資金額, _
                                    wTable.日割日数, p借入金マスタ.金利計算年間日数) '09/12/30
                                    
            
            
          Else                                                                      ' 07/01/31 V180
            
            GDate1 = MBD010_利息計算年月日(w一括支払利息開始年月, p借入金マスタ.支払日, _
                                           p借入金マスタ.営業日区分, p借入金マスタ.利息計算日数区分) '09/12/20 V185
                                           
            If Format(p借入金マスタ.金利初回年月, "yyyy/mm/dd") = Format(p借入金マスタ.初回返済年月, "yyyy/mm/dd") Then   '10/01/01
                If Format(GDate利息対象年月日, "yyyy/mm/dd") <> _
                   Format(p借入金マスタ.初回返済実行日, "yyyy/mm/dd") Then  '10/01/01
                    GDate1 = p借入金マスタ.初回返済実行日                   '10/01/01
                    GDate利息対象年月日 = p借入金マスタ.初回返済実行日      '10/01/01
                End If                                                      '10/01/01
            End If                                                          '10/01/01
                                           
                                           
            wTable.日割日数 = DateDiff("d", p借入金マスタ.実行日, GDate1) + 1   ' 07/01/31 V180
            w内入開始年月日 = p借入金マスタ.実行日          ' 08/12/05 V189
            w内入終了年月日 = GDate1                        ' 08/12/05 V189
            
            GDate1利息対象年月日 = GDate利息対象年月日      'V182 2008/02/28
            wTable.利息対象期間日数 = wTable.日割日数       '09/12/29
            w利息対象内入開始年月日 = p借入金マスタ.実行日          ' 08/12/08 V189
            w利息対象内入終了年月日 = GDate1利息対象年月日          ' 08/12/08 V189
            
            If p借入金マスタ.利息控除区分 = 1 Or p借入金マスタ.利息控除区分 = 3 Then  ' 07/03/05 V180
                wTable.日割日数 = wTable.日割日数 - 1                                 ' 07/03/05 V180
            End If                                                                    ' 07/03/05 V180
            
            If Format(p借入金マスタ.金利初回年月, "yyyy/mm/dd") = _
               Format(p借入金マスタ.初回返済年月, "yyyy/mm/dd") _
               And Format(p借入金マスタ.初回返済年月, "yyyy/mm/dd") = _
                   Format(p借入金マスタ.最終返済年月, "yyyy/mm/dd") _
               And (p借入金マスタ.利息控除区分 = 2 Or p借入金マスタ.利息控除区分 = 3) Then  '09/12/31
                    wTable.日割日数 = wTable.日割日数 - 1               '09/12/31
            End If                                                  '09/12/31

          End If                                                                    ' 07/03/05 V180
            
          wTable.利息額 = MBD010_利息計算小数点5桁(p借入金マスタ.利率, p借入金マスタ.融資金額, _
                                    wTable.日割日数, p借入金マスタ.金利計算年間日数) '09/12/30
            
          
           
          If wTable.日割日数 = 1 And (p借入金マスタ.利息控除区分 = 0 Or _
                                       p借入金マスタ.利息控除区分 = 2) Then         ' 07/02/22 V180
            wp日数 = 1                         ' 07/02/21 V180
            wTable.日割日数 = 0                ' 07/02/21 V180
            wTable.利息対象期間日数 = 0         'V182 2008/01/28
            wTable.利息額 = 0                  ' 07/02/21 V180
            wTable.返済金額 = 0                ' 07/02/21 V180
          End If
             
        Else
          '利息後払
            wTable.日割日数 = 0
            wTable.利息対象期間日数 = 0         'V182 2008/01/28
            wTable.利息額 = 0
            wTable.返済金額 = 0
        End If
        
        wTable.返済金額 = wTable.利息額                                             'V18007/02/01
        
    If p借入金マスタ.利息区分 = XMXA020_区分("利息区分", "利息後払") Then           ' 08/12/06 V189
    
        Call MBD010_内入処理(p借入金マスタ)         ' 08/12/05 V189
    End If                                                                          ' 08/12/06 V189
        
    wTable.据置x回目 = 2                    ' 09/01/16 V189
    wTable.利息計算年月日 = wTable.実際年月日   '10/01/04
    Call MBD010_借入金テーブルWrite(wTable)
    
    
    If p借入金マスタ.利息区分 = XMXA020_区分("利息区分", "利息先払") Then           ' 08/12/06 V189
    
        Call MBD010_内入処理(p借入金マスタ)         ' 08/12/05 V189
    End If                                                                          ' 08/12/06 V189
    
         
    ' -----------------------------------------
    '            据置期間のＤＡＴＡ
    ' -----------------------------------------
    For wRecCount = 0 To w据置回数 - 1
        
        'w内入開始年月日 = Null                  ' 08/12/05 V189
        'w内入終了年月日 = Null                  ' 08/12/05 V189
        
        
        w返済予定年月 = DateAdd("m", wRecCount, w実行支払年月)
        w実際年月日 = MXA030_翌営業年月日計算(w返済予定年月, p借入金マスタ.支払日, p借入金マスタ.営業日区分) ' 07/01/30 V180
        
        
        
        
        
        w内入開始年月日 = Null                                          '10/02/07
        w内入終了年月日 = Null                                          '10/02/07
        
        wTable.借入番号 = p借入金マスタ.借入番号
        wTable.返済回数 = 0
        wTable.据置x回目 = 2                   ' 08/12/06 V189
        wTable.返済予定年月 = w返済予定年月
        wTable.実際年月日 = w実際年月日
        OLD実際年月日 = NEW実際年月日               ' 07/03/24 V180
        NEW実際年月日 = wTable.実際年月日           ' 07/03/24 V180
        
        wTable = MBD010_借入金テーブルRead(wTable)
                
            wTable.実際年月日 = w実際年月日
            wTable.元金額 = 0
            wTable.保証料 = 0
            wTable.融資残高 = w融資残高             ' 08/12/05 V189
            wTable.利率 = MBD010_金利参照(p借入金マスタ, w返済予定年月)
               
            '--------------
            '** 日割日数 **
            '--------------
            If p借入金マスタ.利息区分 = XMXA020_区分("利息区分", "利息先払") Then
              '利息先払い
              If p借入金マスタ.利息支払方法 = 0 Then                                    ' 07 01/31 V180
                '利息毎月支払
                GDate1 = DateAdd("m", 1, w返済予定年月)
                GDate1 = MBD010_利息計算年月日(GDate1, p借入金マスタ.支払日, _
                     p借入金マスタ.営業日区分, p借入金マスタ.利息計算日数区分)  ' 07/01/30 V180
                
                     
                If wRecCount = w据置回数 - 1 Then                               ' 08/07/19 V188
                    If Format(GDate利息対象年月日, "yyyy/mm/dd") <> Format(p借入金マスタ.初回返済実行日, "yyyy/mm/dd") Then  ' 08/07/22 V188
                        GDate1 = p借入金マスタ.初回返済実行日                   ' 08/07/19 V188
                        GDate利息対象年月日 = p借入金マスタ.初回返済実行日      ' 08/07/19 V188
                    End If                                                      ' 08/07/22 V188
                End If                                                          ' 08/07/19 V188
                 
                     
                GDate1利息対象年月日 = GDate利息対象年月日      'V182 2008/02/28
                 
                GDate2 = MBD010_利息計算年月日(w返済予定年月, p借入金マスタ.支払日, _
                     p借入金マスタ.営業日区分, p借入金マスタ.利息計算日数区分)  ' 07/01/30 V180
                wTable.日割日数 = DateDiff("d", GDate2, GDate1)                     ' 07/01/31 V180
                w内入開始年月日 = GDate2                    ' 08/12/05 V189
                w内入終了年月日 = GDate1                    ' 08/12/05 V189
                
                GDate2利息対象年月日 = GDate利息対象年月日      'V182 2008/02/28
                wTable.利息対象期間日数 = wTable.日割日数       '09/12/29
                w利息対象内入開始年月日 = GDate2利息対象年月日          ' 08/12/08 V189
                w利息対象内入終了年月日 = GDate1利息対象年月日          ' 08/12/08 V189
                wTable.日割日数 = wTable.日割日数 + wp日数
                wTable.利息対象期間日数 = wTable.日割日数       '09/12/29
                wp日数 = 0
                
                GDate1 = DateAdd("m", 1, w返済予定年月)                         'V180 07/02/01
                If GDate1 = p借入金マスタ.最終返済年月 Then                     'V180 07/02/01
                    If p借入金マスタ.利息控除区分 = 2 Or p借入金マスタ.利息控除区分 = 3 Then
                        wTable.日割日数 = wTable.日割日数 - 1                       'V180 07/02/01
                    End If
                End If                                                          'V180 07/02/01
                    
                '***据え置き期間　実行日に金利初回年月まで徴収した調整
                If Format(w返済予定年月, "yyyy/mm/dd") < Format(p借入金マスタ.金利初回年月, "yyyy/mm/dd") Then  ' 09/12/22
                    wTable.日割日数 = 0             ' 09/12/22
                    wTable.利息対象期間日数 = 0     ' 09/12/22
                    w内入開始年月日 = Null          '10/02/13
                    w内入終了年月日 = Null          '10/02/13
                End If                              ' 09/12/22
                
                    
              Else                                                                  ' 07/01/31 V180
                '利息一括支払
                w有効F = MBD010_借入金据置期間一括利息支払(wTable.返済予定年月, w一括支払利息開始年月 _
                         , p借入金マスタ.初回返済年月, p借入金マスタ.利息区分, p借入金マスタ.返済単位月数) '08/03/14 V185
                If w有効F = 1 Then                                      '08/03/14 V185
                    GDate1 = DateAdd("m", p借入金マスタ.返済単位月数, w返済予定年月) '08/03/14 V185
                    GDate2 = GDate1                     '10/02/09
                    GDate1 = MBD010_利息計算年月日(GDate1, p借入金マスタ.支払日, _
                     p借入金マスタ.営業日区分, p借入金マスタ.利息計算日数区分)  ' 08/03/14 V185
                     
                    If Format(GDate2, "yyyy/mm/dd") = Format(p借入金マスタ.初回返済年月, "yyyy/mm/dd") _
                        And Format(p借入金マスタ.初回返済実行日, "yyyy/mm/dd") _
                         <> Format(GDate利息対象年月日, "yyyy/mm/dd") Then          '10/02/09
                        GDate1 = p借入金マスタ.初回返済実行日                       ' 10/01/01
                        GDate利息対象年月日 = p借入金マスタ.初回返済実行日          ' 10/01/01
                    End If                                                          ' 10/01/01
                     
                    GDate1利息対象年月日 = GDate利息対象年月日      '08/03/14 V185
                    
                    GDate2 = MBD010_利息計算年月日(w返済予定年月, p借入金マスタ.支払日, _
                     p借入金マスタ.営業日区分, p借入金マスタ.利息計算日数区分)  ' 08/03/14 V185
                    wTable.日割日数 = DateDiff("d", GDate2, GDate1)             ' 08/03/14 V185
                    w内入開始年月日 = GDate2                    ' 08/12/05 V189
                    w内入終了年月日 = GDate1                    ' 08/12/05 V189
                    
                    GDate2利息対象年月日 = GDate利息対象年月日      '08/03/14 V185
                    wTable.利息対象期間日数 = wTable.日割日数       '09/12/29
                    w利息対象内入開始年月日 = GDate2利息対象年月日          ' 08/12/08 V189
                    w利息対象内入終了年月日 = GDate1利息対象年月日          ' 08/12/08 V189
                    
                    GDate1 = DateAdd("m", p借入金マスタ.返済単位月数, w返済予定年月)    '10/01/01
                    If GDate1 = p借入金マスタ.最終返済年月 Then                         '10/01/01
                        If p借入金マスタ.利息控除区分 = 2 Or p借入金マスタ.利息控除区分 = 3 Then    '10/01/01
                            wTable.日割日数 = wTable.日割日数 - 1                       '10/01/01
                        End If                                                          '10/01/01
                    End If                                                              '10/01/01
                    
                Else                                        '08/03/14 V185
                    wTable.日割日数 = 0                                                 ' 07/01/31 V180
                    wTable.利息対象期間日数 = 0                                     'V182 2008/01/28
                End If                                      '08/03/14 V185
                
              End If                                                                ' 07/01/31 V180
                
            Else
              '利息後払い
              If p借入金マスタ.利息支払方法 = 0 Then                                ' 07/01/31 V180
                '利息毎月支払
                If w返済予定年月 = p借入金マスタ.金利初回年月 Then                  ' 07/01/31 V180
                    GDate1 = MBD010_利息計算年月日(w返済予定年月, p借入金マスタ.支払日, _
                     p借入金マスタ.営業日区分, p借入金マスタ.利息計算日数区分)  ' 07/01/30 V180
                     
                    wTable.日割日数 = DateDiff("d", p借入金マスタ.実行日, GDate1) + 1   ' 07/01/31 V180
                    w内入開始年月日 = p借入金マスタ.実行日      ' 08/12/05 V189
                    w内入終了年月日 = GDate1                    ' 08/12/05 V189
                    
                    GDate1利息対象年月日 = GDate利息対象年月日      'V182 2008/02/28
                    wTable.利息対象期間日数 = wTable.日割日数       '09/12/29
                    w利息対象内入開始年月日 = p借入金マスタ.実行日          ' 08/12/08 V189
                    w利息対象内入終了年月日 = GDate1利息対象年月日          ' 08/12/08 V189
                
                    If p借入金マスタ.利息控除区分 = 1 Or p借入金マスタ.利息控除区分 = 3 Then ' 07/01/31 V180
                        wTable.日割日数 = wTable.日割日数 - 1                       ' 07/01/31 V180
                    End If                                                          ' 07/01/31 V180
                Else                                                                ' 07/01/31 V180
                    If w返済予定年月 > p借入金マスタ.金利初回年月 Then              ' 07/01/31 V180
                        GDate1 = MBD010_利息計算年月日(w返済予定年月, p借入金マスタ.支払日, _
                          p借入金マスタ.営業日区分, p借入金マスタ.利息計算日数区分) ' 07/01/30 V180
                          
                        GDate1利息対象年月日 = GDate利息対象年月日      'V182 2008/02/28
                        
                        GDate2 = DateAdd("m", -1, w返済予定年月)                    ' 07/01/31 V180
                        GDate2 = MBD010_利息計算年月日(GDate2, p借入金マスタ.支払日, _
                          p借入金マスタ.営業日区分, p借入金マスタ.利息計算日数区分) '07/01/30 V180
                        wTable.日割日数 = DateDiff("d", GDate2, GDate1)              ' 07/01/31 V180
                        w内入開始年月日 = GDate2                    ' 08/12/05 V189
                        w内入終了年月日 = GDate1                    ' 08/12/05 V189
                        
                        
                        GDate2利息対象年月日 = GDate利息対象年月日      'V182 2008/02/28
                        wTable.利息対象期間日数 = wTable.日割日数       '09/12/29
                        w利息対象内入開始年月日 = GDate2利息対象年月日          ' 08/12/08 V189
                        w利息対象内入終了年月日 = GDate1利息対象年月日          ' 08/12/08 V189
                    Else                                                            ' 07/01/31 V180
                    
                              
                        wTable.日割日数 = 0                                         ' 07/01/31 V180
                        wTable.利息対象期間日数 = 0         'V182 2008/01/29
                    End If                                                          ' 07/01/31 V180
                    
                End If                                                              ' 07/01/31 V180
                
              Else                                                                  ' 07/01/31 V180
                '利息一括支払
                w有効F = MBD010_借入金据置期間一括利息支払(wTable.返済予定年月, w一括支払利息開始年月 _
                         , p借入金マスタ.初回返済年月, p借入金マスタ.利息区分, p借入金マスタ.返済単位月数) '08/03/14 V185
                If w有効F = 1 Then                                      '08/03/14 V185
                    If Format(w返済予定年月, "yyyy/mm/dd") = Format(w一括支払利息開始年月, "yyyy/mm/dd") Then ' 2009/12/20
                        GDate1 = p借入金マスタ.実行日           ' 2009/12/20
                        GDate利息対象年月日 = p借入金マスタ.実行日  ' 2009/12/20
                    Else                                        ' 2009/12/20
                        GDate1 = DateAdd("m", -p借入金マスタ.返済単位月数, w返済予定年月) '08/03/14 V185
                    
                        GDate1 = MBD010_利息計算年月日(GDate1, p借入金マスタ.支払日, _
                            p借入金マスタ.営業日区分, p借入金マスタ.利息計算日数区分)  ' 08/03/14 V185
                     
                    End If                                          ' 2009/12/20
                     
                     
                    GDate1利息対象年月日 = GDate利息対象年月日      '08/03/14 V185
                    
                    w初回利息F = 0                                  '08/03/14 V185
                    
                    If GDate1 < p借入金マスタ.実行日 Then           '08/03/14 V185
                        GDate1 = DateAdd("d", -1, p借入金マスタ.実行日)             '08/03/14 V185
                        GDate1利息対象年月日 = DateAdd("d", -1, p借入金マスタ.実行日) '08/03/14 V185
                        w初回利息F = 1                              '08/03/04 V185
                    Else
                        If GDate1 = p借入金マスタ.実行日 Then       '09/12/31
                            w初回利息F = 1                          '09/12/31
                        End If                                      '09/12/31
                    End If
                                                                    '08/03/04 V185
                                                                    
                    GDate2 = MBD010_利息計算年月日(w返済予定年月, p借入金マスタ.支払日, _
                     p借入金マスタ.営業日区分, p借入金マスタ.利息計算日数区分)  ' 08/03/14 V185
                     
                    If wRecCount = w据置回数 - 1 Then                                   ' 08/07/19 V188
                        If Format(GDate利息対象年月日, "yyyy/mm/dd") <> Format(p借入金マスタ.初回返済実行日, "yyyy/mm/dd") Then ' 08/07/19 V188
                            GDate2 = p借入金マスタ.初回返済実行日                       ' 08/07/19 V188
                            GDate利息対象年月日 = p借入金マスタ.初回返済実行日         ' 08/07/19 V188
                        End If                                                          ' 08/07/19 V188
                    End If                                                              ' 08/07/19 V188
                    
                    If Format(w返済予定年月, "yyyy/mm/dd") = Format(w一括支払利息開始年月, "yyyy/mm/dd") Then ' 2009/12/20
                        wTable.日割日数 = DateDiff("d", GDate1, GDate2) + 1 ' 2009/12/20
                    Else                                                    ' 2009/12/20
                        wTable.日割日数 = DateDiff("d", GDate1, GDate2)             ' 08/03/14 V185
                    End If                                                  ' 2009/12/20
                    
                    w内入開始年月日 = GDate1                    ' 08/12/05 V189
                    w内入終了年月日 = GDate2                    ' 08/12/05 V189
                    
                    GDate2利息対象年月日 = GDate利息対象年月日      '08/03/14 V185
                    wTable.利息対象期間日数 = wTable.日割日数       '09/12/29
                    w利息対象内入開始年月日 = GDate1利息対象年月日          ' 08/12/08 V189
                    w利息対象内入終了年月日 = GDate2利息対象年月日          ' 08/12/08 V189
                    If w初回利息F = 1 And (p借入金マスタ.利息控除区分 = 1 Or p借入金マスタ.利息控除区分 = 3) Then ' 08/03/141 V185
                        wTable.日割日数 = wTable.日割日数 - 1                       ' 07/01/31 V180
                    End If                                                          ' 07/01/31 V180
                Else                                        '08/03/14 V185
                    wTable.日割日数 = 0                                                 ' 07/01/31 V180
                    wTable.利息対象期間日数 = 0                                     'V182 2008/01/28
                End If                                      '08/03/14 V185
                
              End If                                                                ' 07/01/31 V180
              
            End If                                                                  ' 07/01/31 V180
            
              
            '** 解約 **
            If Not IsNull(w解約実行日) Then
                If Format(w実際年月日, "yyyy/mm/dd") >= Format(w解約実行日, "yyyy/mm/dd") Then
                     
                    If p借入金マスタ.利息区分 = XMXA020_区分("利息区分", "利息先払") Then
                      '利息先払い
                      If p借入金マスタ.利息支払方法 = 0 Then                        ' 07/01/31 V180
                        '利息毎月支払
                        
                        '実行日に金利初回まで徴収した調整
                        If Format(p借入金マスタ.金利初回年月, "yyyy/mm/dd") _
                                    = Format(p借入金マスタ.初回返済年月, "yyyy/mm/dd") _
                                And Format(p借入金マスタ.金利初回年月, "yyyy/mm/dd") _
                                    = Format(p借入金マスタ.最終返済年月, "yyyy/mm/dd") Then     '10/02/16
                            GDate1 = MBD010_利息計算年月日(p借入金マスタ.金利初回年月, p借入金マスタ.支払日, _
                                p借入金マスタ.営業日区分, p借入金マスタ.利息計算日数区分)   '10/02/16
                        Else                                                                '10/02/16
                                                
                            If Format(w返済予定年月, "yyyy/mm/dd") < Format(p借入金マスタ.金利初回年月, "yyyy/mm/dd") Then ' 09/12/22
                                GDate1 = MBD010_利息計算年月日(p借入金マスタ.金利初回年月, p借入金マスタ.支払日, _
                                    p借入金マスタ.営業日区分, p借入金マスタ.利息計算日数区分)  ' 09/12/22
                            Else                                                            ' 09/12/22
                
                                GDate1 = MBD010_利息計算年月日(w返済予定年月, p借入金マスタ.支払日, _
                                    p借入金マスタ.営業日区分, p借入金マスタ.利息計算日数区分)  ' 07/01/30 V180
                            End If                                                          ' 09/12/22
                        End If                                                              '10/02/16
                        
                        '*初回返済日が手打ちの時の調整
                        If Format(w返済予定年月, "yyyy/mm/dd") = Format(p借入金マスタ.初回返済年月, "yyyy/mm/dd") _
                           Or (Format(p借入金マスタ.金利初回年月, "yyyy/mm/dd") _
                                    = Format(p借入金マスタ.初回返済年月, "yyyy/mm/dd") _
                                And Format(p借入金マスタ.金利初回年月, "yyyy/mm/dd") _
                                    = Format(p借入金マスタ.最終返済年月, "yyyy/mm/dd")) _
                            And Format(GDate利息対象年月日, "yyyy/mm/dd") _
                                <> Format(p借入金マスタ.初回返済実行日, "yyyy/mm/dd") Then  '10/02/16
                            GDate1 = p借入金マスタ.初回返済実行日           '10/02/09
                            GDate利息対象年月日 = p借入金マスタ.初回返済実行日   '10/02/09
                        End If                                              '10/02/09
                        
                        
                        
                            
                        wTable.日割日数 = DateDiff("d", w解約実行日, GDate1) * -1   ' 07/01/31 V180
                        
                        w内入開始年月日 = w解約実行日           '10/01/30
                        w内入終了年月日 = GDate1                '10/01/30
                         
                        GDate1利息対象年月日 = GDate利息対象年月日          'V182 2008/01/29
                        wTable.利息対象期間日数 = wTable.日割日数       '09/12/29
                        
                        '***金利初回年月=初回返済年月=最終返済年月の時　10/02/13
                        If Format(p借入金マスタ.金利初回年月, "yyyy/mm/dd") _
                                    = Format(p借入金マスタ.初回返済年月, "yyyy/mm/dd") _
                                And Format(p借入金マスタ.金利初回年月, "yyyy/mm/dd") _
                                    = Format(p借入金マスタ.最終返済年月, "yyyy/mm/dd") Then
                                    
                                'And (p借入金マスタ.利息控除区分 = 2 Or p借入金マスタ.利息控除区分 = 3) _
                                'Then                                    '10/02/13
                                  
                            'wTable.日割日数 = wTable.日割日数 + 1           '10/02/13
                        Else                                              '10/02/13
                        
                            If p借入金マスタ.利息控除区分 = 2 Or p借入金マスタ.利息控除区分 = 3 Then
                                wTable.日割日数 = wTable.日割日数 - 1                   ' 2012/03/21
                            End If                                                      ' 07/03/05 V180
                        End If                                                          '10/02/13
                        
                      Else                                                          ' 07/03/05 V180
                      
                        '利息一括支払い
                        
                        GDate1 = MBD010_借入金解約据置期間一括利息支払日(w解約実行日, _
                                                  p借入金マスタ.実行日, _
                                                  w返済予定年月, _
                                                  w一括支払利息開始年月, _
                                                  p借入金マスタ.初回返済年月, _
                                                  p借入金マスタ.利息区分, _
                                                  p借入金マスタ.返済単位月数, _
                                                  p借入金マスタ.支払日, _
                                                  p借入金マスタ.営業日区分, _
                                                  p借入金マスタ.利息計算日数区分)    '10/02/02
                                                  
                                                  
                        '*初回返済日が手打ちの時の調整
                        GDate2 = MBD010_利息計算年月日(p借入金マスタ.初回返済年月, p借入金マスタ.支払日, _
                            p借入金マスタ.営業日区分, p借入金マスタ.利息計算日数区分)       '10/02/09
                        If Format(GDate1, "yyyy/mm/dd") = Format(GDate2, "yyyy/mm/dd") _
                              And Format(GDate利息対象年月日, "yyyy/mm/dd") <> _
                                  Format(p借入金マスタ.初回返済実行日, "yyyy/mm/dd") Then '10/02/15
                            GDate1 = p借入金マスタ.初回返済実行日           '10/02/09
                            GDate利息対象年月日 = p借入金マスタ.初回返済実行日  '10/02/09
                        End If                                            '10/02/09
                                                  
                        wTable.日割日数 = DateDiff("d", w解約実行日, GDate1) * -1   ' 09/12/20 V180
                        
                        w内入開始年月日 = w解約実行日           '10/01/30
                        w内入終了年月日 = GDate1                '10/01/30
                        
                          
                        GDate1利息対象年月日 = GDate利息対象年月日          'V182 2008/01/29
                        wTable.利息対象期間日数 = wTable.日割日数       '09/12/29
                        
                        '*** 金利初回年月=初回返済年月=最終返済年月の時 10/02/13
                        GDate2 = MBD010_利息計算年月日(p借入金マスタ.金利初回年月, p借入金マスタ.支払日 _
                                       , p借入金マスタ.営業日区分, p借入金マスタ.利息計算日数区分)
                        If Format(p借入金マスタ.金利初回年月, "yyyy/mm/dd") = _
                            Format(p借入金マスタ.最終返済年月, "yyyy/mm/dd") Then   '10/02/13
                            If Format(GDate利息対象年月日, "yyyy/mm/dd") <> _
                                Format(p借入金マスタ.最終返済実行日, "yyyy/mm/dd") Then '10/02/13
                                GDate2 = p借入金マスタ.最終返済実行日                    '10/02/13
                            End If                                                      '10/02/13
                        End If                                                          '10/02/13
                        
                        If Format(p借入金マスタ.金利初回年月, "yyyy/mm/dd") _
                                    = Format(p借入金マスタ.初回返済年月, "yyyy/mm/dd") _
                                And Format(p借入金マスタ.金利初回年月, "yyyy/mm/dd") _
                                    = Format(p借入金マスタ.最終返済年月, "yyyy/mm/dd") Then     '10/02/16
                        Else                                              '10/02/13
                        
                            GDate2 = MBD010_利息計算年月日(DateAdd("m", -p借入金マスタ.返済単位月数, p借入金マスタ.最終返済年月), _
                             p借入金マスタ.支払日, p借入金マスタ.営業日区分, p借入金マスタ.利息計算日数区分)    '10/02/11
                        
                            If Format(GDate2, "yyyy/mm/dd") >= _
                                Format(w解約実行日, "yyyy/mm/dd") _
                               Or wTable.日割日数 > 0 Then                     '10/02/11
                                If p借入金マスタ.利息控除区分 = 2 Or p借入金マスタ.利息控除区分 = 3 Then    '08/03/16 V185
                                    wTable.日割日数 = wTable.日割日数 - 1           '08/03/16 V185
                                End If                                              '08/03/16 V185
                            Else                                                    '10/02/07
                                'If p借入金マスタ.利息控除区分 = 2 Or p借入金マスタ.利息控除区分 = 3 Then    '08/03/16 V185
                                '    wTable.日割日数 = wTable.日割日数 + 1           '10/02/07
                                'End If
                            End If                                                  '10/02/07
                        End If                                                    '10/02/13
                          
                        'Else                                                        ' 07/01/31 V180
                        '  GDate1 = MBD010_利息計算年月日(p借入金マスタ.初回返済年月, p借入金マスタ.支払日, _
                        '    p借入金マスタ.営業日区分, p借入金マスタ.利息計算日数区分) '07/01/30 V180
                        '  wTable.日割日数 = DateDiff("d", w解約実行日, GDate1) * -1 ' 07/01/31 V180
                          
                        '  GDate1利息対象年月日 = GDate利息対象年月日          'V182 2008/01/29
                        '  wTable.利息対象期間日数 = DateDiff("d", w解約実行日, GDate1利息対象年月日) * -1 'V182 2008/01/29
                          
                        '  If p借入金マスタ.利息控除区分 = 2 Or p借入金マスタ.利息控除区分 = 3 Then
                        '      wTable.日割日数 = wTable.日割日数 - 1                 ' 07/03/05 V180
                        '    End If                                                  ' 07/03/05 V180
                        'End If                                                      ' 07/03/05 V180
                      End If                                                        ' 07/01/31 V180
                      
                      'If p借入金マスタ.利息控除区分 = 2 Or p借入金マスタ.利息控除区分 = 3 Then
                      '  wTable.日割日数 = wTable.日割日数 - 1                       ' 07/01/31 V180
                      'End If                                                        ' 07/01/31 V180
                   
                      'wTable.利率 = MBD010_金利参照(p借入金マスタ, DateAdd("m", -1, w返済予定年月))
                      
                    Else
                      '利息後払い
                      If p借入金マスタ.利息支払方法 = 0 Then                        ' 07/01/31 V180
                        '利息毎月支払
                        If w返済予定年月 <= p借入金マスタ.金利初回年月 Then         ' 07/01/31 V180
                          wTable.日割日数 = DateDiff("d", p借入金マスタ.実行日, w解約実行日) + 1
                          
                          w内入開始年月日 = p借入金マスタ.実行日          '10/01/30
                          w内入終了年月日 = w解約実行日                   '10/01/30
                           
                          wTable.利息対象期間日数 = wTable.日割日数     '09/12/29
                                                    
                          If p借入金マスタ.利息控除区分 = 1 Or p借入金マスタ.利息控除区分 = 2 Then
                            wTable.日割日数 = wTable.日割日数 - 1                   ' 07/01/31 V180
                          Else                                                      ' 07/01/31 V180
                            If p借入金マスタ.利息控除区分 = 3 Then                  ' 07/01/31 V180
                                wTable.日割日数 = wTable.日割日数 - 2               ' 07/01/31 V180
                            End If                                                  ' 07/01/31 V180
                          End If                                                    ' 07/01/31 V180
                        Else                                                        ' 07/01/31 V180
                          GDate2 = DateAdd("m", -1, w返済予定年月)                  ' 07/01/31 V180
                          GDate2 = MBD010_利息計算年月日(GDate2, p借入金マスタ.支払日, _
                            p借入金マスタ.営業日区分, p借入金マスタ.利息計算日数区分)
                          wTable.日割日数 = DateDiff("d", GDate2, w解約実行日)      ' 07/01/31 V180
                          
                          w内入開始年月日 = GDate2                        '10/01/30
                          w内入終了年月日 = w解約実行日                   '10/01/30
                          
                          
                          GDate2利息対象年月日 = GDate利息対象年月日          'V182 2008/01/29
                          wTable.利息対象期間日数 = wTable.日割日数     '09/12/29
                          
                          If p借入金マスタ.利息控除区分 = 2 Or p借入金マスタ.利息控除区分 = 3 Then
                            wTable.日割日数 = wTable.日割日数 - 1                   ' 07/01/31 V180
                          End If                                                    ' 07/01/31 V180
                        End If                                                      ' 07/01/31 V180
                      Else                                                          ' 07/01/31 V180
                        '利息一括支払
                        'wTable.日割日数 = DateDiff("d", p借入金マスタ.実行日, w解約実行日) + 1 ' 07/01/31 V180
                        
                        'wTable.利息対象期間日数 = DateDiff("d", p借入金マスタ.実行日, w解約実行日) + 1 'V182 2008/01/29
                        
                        'If p借入金マスタ.利息控除区分 = 1 Or p借入金マスタ.利息控除区分 = 2 Then
                            'wTable.日割日数 = wTable.日割日数 - 1                   ' 07/01/31 V180
                        'Else                                                        ' 07/01/31 V180
                            'If p借入金マスタ.利息控除区分 = 3 Then                  ' 07/01/31 V180
                                'wTable.日割日数 = wTable.日割日数 - 2               ' 07/01/31 V180
                            'End If                                                  ' 07/01/31 V180
                        'End If                                                      ' 07/01/31 V180
                          
                        GDate1 = MBD010_借入金解約据置期間一括利息支払日(w解約実行日, _
                                                  p借入金マスタ.実行日, _
                                                  w返済予定年月, _
                                                  w一括支払利息開始年月, _
                                                  p借入金マスタ.初回返済年月, _
                                                  p借入金マスタ.利息区分, _
                                                  p借入金マスタ.返済単位月数, _
                                                  p借入金マスタ.支払日, _
                                                  p借入金マスタ.営業日区分, _
                                                  p借入金マスタ.利息計算日数区分)    '10/02/02
                          
                          
                        'GDate1 = MBD010_利息計算年月日(GDate1, p借入金マスタ.支払日, _
                        ' p借入金マスタ.営業日区分, p借入金マスタ.利息計算日数区分) '08/03/14 V185
                         
                         
                        '**一括支払利息開始日までの解約の場合
                        w年月日 = MBD010_利息計算年月日(w一括支払利息開始年月, p借入金マスタ.支払日, _
                         p借入金マスタ.営業日区分, p借入金マスタ.利息計算日数区分) '09/12/20 V185
                        
                        If Format(w年月日, "yyyy/mm/dd") >= Format(w解約実行日, "yyyy/mm/dd") Then   ' 2010/01/24
                            GDate1利息対象年月日 = DateDiff("d", p借入金マスタ.実行日, w解約実行日) + 1 ' 2009/12/20 V188                  '08/03/14 V185
                            
                            wTable.日割日数 = DateDiff("d", p借入金マスタ.実行日, w解約実行日) + 1  '2009/12/20
                            
                            w内入開始年月日 = p借入金マスタ.実行日          '10/01/30
                            w内入終了年月日 = w解約実行日                   '10/01/30
                            
                            wTable.利息対象期間日数 = wTable.日割日数       '09/12/29
                            w初回利息F = 1                                  '2009/12/20
                         Else                                               ' 2009/12/20
                            wTable.日割日数 = DateDiff("d", GDate1, w解約実行日)     '2009/12/20 V185
                            
                            w内入開始年月日 = GDate1                        '10/01/30
                            w内入終了年月日 = w解約実行日                   '10/01/30
                            
                            wTable.利息対象期間日数 = wTable.日割日数       '09/12/29
                            w初回利息F = 0                                  '2009/12/20
                         End If                                             ' 2009/12/20
                         
                        
                        '***** 仮に無効とした　'*  08/07/21 V188
                        'w初回利息F = 0                  '08/03/16 V185
                        'If Format(GDate1, "yyyymmdd") = Format(p借入金マスタ.実行日, "yyyymmdd") Then '08/03/16 V185
                        '    wTable.日割日数 = DateDiff("d", GDate1, w解約実行日) + 1    '08/03/16 V185
                        '    wTable.利息対象期間日数 = DateDiff("d", GDate1, w解約実行日) + 1 '08/03/16 V185
                        '    w初回利息F = 1                  '08/03/16 V185
                        'Else                                '08/03/16 V185
                        '    wTable.日割日数 = DateDiff("d", GDate1, w解約実行日)        '08/03/14 V185
                        '    GDate1利息対象年月日 = GDate利息対象年月日                  '08/03/14 V185
                        '    wTable.利息対象期間日数 = DateDiff("d", GDate1利息対象年月日, w解約実行日)  '08/03/14 V185
                        'End If                              '08/03/16 V185
                        ''*****
                        
                        '*** 仮に追加した　08/07/21 V188
                        
                        'wTable.日割日数 = DateDiff("d", p借入金マスタ.実行日, w解約実行日) + 1 '08/07/21 V188
                        
                        'GDate1利息対象年月日 = DateDiff("d", p借入金マスタ.実行日, w解約実行日) + 1 ' 08/07/21 V188                  '08/03/14 V185
                        'wTable.利息対象期間日数 = DateDiff("d", p借入金マスタ.実行日, w解約実行日) + 1  '08/03/14 V185
                        'w初回利息F = 1                               ' 08/07/21 V188
                        '***
                        
                        If w初回利息F = 1 And (p借入金マスタ.利息控除区分 = 1 Or p借入金マスタ.利息控除区分 = 3) Then '08/03/16 V185
                            wTable.日割日数 = wTable.日割日数 - 1   '08/03/16 V185
                        End If                                      '08/03/16 V185
                        
                        If p借入金マスタ.利息控除区分 = 2 Or p借入金マスタ.利息控除区分 = 3 Then '08/03/16 V185
                            wTable.日割日数 = wTable.日割日数 - 1   '08/03/16 V185
                        End If                                      '08/03/16 V185
                        
                        
                      End If                                                        ' 07/01/31 V180
                      
                    End If                                                          ' 07/01/31 V180
                         
                    wTable.日割日数 = wTable.日割日数 + w日割日数                   ' 07/03/23 V180
                    
                    'wTable.利率 = MBD010_金利参照(p借入金マスタ, w返済予定年月)
                Else                                                                ' 07/03/23 V180
                    w日割日数 = 0                                                   ' 07/03/23 V180
                End If
            End If
            
            '--------------
            '** 利息計算 **
            '--------------
            '** 解約の時　解約実行日を、実際年月日にセット **
            
            If Not IsNull(w解約実行日) And wTable.実際年月日 >= w解約実行日 Then   '解約
                wTable.実際年月日 = w解約実行日
            End If
            
            '解約日調整＆利息計算年月日　セット（据置期間）
            If Not IsNull(w解約実行日) And _
                Format(wTable.実際年月日, "yyyy/mm/dd") = Format(w解約実行日, "yyyy/mm/dd") Then '10/01/04
                    wTable.利息計算年月日 = w解約実行日         '10/01/23
                
            Else                                            '10/01/04
                wTable.利息計算年月日 = MBD010_利息計算年月日(wTable.返済予定年月, p借入金マスタ.支払日, _
                         p借入金マスタ.営業日区分, p借入金マスタ.利息計算日数区分) '10/01/04
            End If                                          '10/01/04
            
            '*** 変動金利　設定
            If p借入金マスタ.利息区分 = XMXA020_区分("利息区分", "利息先払") Then   ' 08/012/10 V189
                If Not IsNull(w解約実行日) And _
                    Format(wTable.実際年月日, "yyyy/mm/dd") = Format(w解約実行日, "yyyy/mm/dd") Then
                    w利息計算基準年月日 = DateAdd("d", -1, wTable.利息計算年月日)   '10/01/23
                Else                                                                '10/01/23
                    w利息計算基準年月日 = wTable.利息計算年月日                     '10/01/23
                End If                                                              '10/01/23
                
            Else                                                                ' 08/12/10 V189
                w利息計算基準年月日 = DateAdd("d", -wTable.利息対象期間日数, wTable.利息計算年月日) '10/01/04
            End If                                                              ' 08/12/10 V189
            wTable.利率 = MBD010_金利参照(p借入金マスタ, w利息計算基準年月日)   ' 08/12/10 V189
            
            
            'If p借入金マスタ.金利計算年間日数 = 0 Then                          ' 07/01/31 V180
            '    wTable.利息額 = Fix(p借入金マスタ.融資金額 * CCur(wTable.利率) * wTable.日割日数 / 36500)
            'Else                                                                    ' 07/01/31 V180
            '    wTable.利息額 = Fix(p借入金マスタ.融資金額 * CCur(wTable.利率) * wTable.日割日数 / 36000)
            'End If                                                                  ' 07/01/31 V180
            wTable.利息額 = MBD010_利息計算小数点5桁(wTable.利率, p借入金マスタ.融資金額, _
                                    wTable.日割日数, p借入金マスタ.金利計算年間日数) '09/12/30
            
            
            wTable.返済金額 = wTable.利息額
            
            '** 解約の時　解約年月日を、実際年月日にセット **
            If Not IsNull(w解約実行日) And w実際年月日 >= w解約実行日 Then   '解約
                wTable.実際年月日 = w解約実行日
            End If
            
            '借入実行日= 据置１回目年月日&利息先払&利息一括支払　データは　実行日のＤＡＴＡを優先する
            If Format(p借入金マスタ.実行日, "yyyy/mm/dd") = Format(w実際年月日, "yyyy/mm/dd") _
                And p借入金マスタ.利息区分 = XMXA020_区分("利息区分", "利息先払") _
                And p借入金マスタ.利息支払方法 = 1 Then                     ' 08/07/20 V188
                Call MBD010_内入処理(p借入金マスタ)                         ' 08/12/05 V189
            Else                                                            ' 08/07/20 V188
                If p借入金マスタ.利息区分 = XMXA020_区分("利息区分", "利息先払") Then   ' 08/12/05 V189
                    wTable.据置x回目 = 2                                    ' 09/01/16 V189
                    Call MBD010_借入金テーブルWrite(wTable)                 ' 08/12/05 V189
                    Call MBD010_内入処理(p借入金マスタ)                     ' 08/12/05 V189
                Else                                                        ' 08/12/05 V189
                    
                    Call MBD010_内入処理(p借入金マスタ)                     ' 08/12/05 V189
                    wTable.据置x回目 = 2                                    ' 09/01/16 V189
                    Call MBD010_借入金テーブルWrite(wTable)                 ' 08/12/05 V189
                End If                                                      ' 08/12/05 V189
            End If                              ' 08/07/20 V188
            
    Next
  End If                                        '10/05/06 V195
  
    ' -----------------------------------------
    '            初回返済以降のＤＡＴＡ
    ' -----------------------------------------
    w融資残高 = p借入金マスタ.融資金額 'XX Add
        
    For wRecCount = 0 To p借入金マスタ.支払回数 - 1
        
        w返済予定年月 = DateAdd("m", wRecCount, p借入金マスタ.初回返済年月)
        
           
        If wRecCount = 0 Then                               ' 08/07/19 V188
                w実際年月日 = p借入金マスタ.初回返済実行日  ' 08/07/19 V188
        Else                                            ' 08/07/19 V188
            If wRecCount = p借入金マスタ.支払回数 - 1 Then  ' 08/07/19 V188
                w実際年月日 = p借入金マスタ.最終返済実行日  ' 08/07/19 V188
            Else                                        ' 08/07/19 V188
                w実際年月日 = MXA030_翌営業年月日計算(w返済予定年月, p借入金マスタ.支払日, p借入金マスタ.営業日区分) ' 07/01/30 V180
            End If                                      ' 08/07/19 V188
        End If                                          ' 08/07/19 V188
        
        
        'w内入開始年月日 = Null                          ' 08/12/05 V189
        'w内入終了年月日 = Null                          ' 08/12/05 V189
                
        wTable.借入番号 = p借入金マスタ.借入番号
        wTable.返済回数 = wRecCount + 1
        wTable.据置x回目 = 2                    ' 08/12/06 V189
        wTable.返済予定年月 = w返済予定年月
        wTable.実際年月日 = w実際年月日
        OLD実際年月日 = NEW実際年月日                   ' 07/03/24 V180
        NEW実際年月日 = wTable.実際年月日               ' 07/03/24 V180
        
        wTable = MBD010_借入金テーブルRead(wTable)
        
            wTable.実際年月日 = w実際年月日
            
            '**返済単位月数による返済月の算出
            w返済単位判定 = wRecCount + 1 + p借入金マスタ.返済単位月数 - 1
            w返済単位回数 = Fix(w返済単位判定 / p借入金マスタ.返済単位月数)
            If w返済単位回数 * p借入金マスタ.返済単位月数 = w返済単位判定 Then
                Select Case wRecCount
                    Case 0:                     wTable.元金額 = p借入金マスタ.初回返済額
                    Case p借入金マスタ.支払回数 - 1: wTable.元金額 = p借入金マスタ.最終返済額
                    Case Else:                  wTable.元金額 = p借入金マスタ.毎月返済額
                End Select
            Else
                wTable.元金額 = 0
            End If
            
                
                    
            wTable.保証料 = 0
            'wTable.利率 = MBD010_金利参照(p借入金マスタ, w返済予定年月)
            w内入開始年月日 = Null                                          '10/02/07
            w内入終了年月日 = Null                                          '10/02/07
            '***元金、利息がゼロの時　w内入開始年月日　w内入終了年月日 の初期値セット
          'If Format(w返済予定年月, "yyyy/mm/dd") >= Format(p借入金マスタ.最終返済年月, "yyyy/mm/dd") Then
          'Else                                                              '10/02/07
          '
          '  wx = w返済単位判定 - w返済単位回数 * p借入金マスタ.返済単位月数 '10/02/05 後払
          '  wY = p借入金マスタ.返済単位月数                                 '10/02/05
          '  wZ = wY - wx                                                    '10/02/05 先払
          '  If p借入金マスタ.利息区分 = XMXA020_区分("利息区分", "利息先払") Then       '10/02/05
          '      '*利息先払
          '      GDate1 = DateAdd("m", wZ, w返済予定年月)                                 '10/02/05
          '      GDate1 = MBD010_利息計算年月日(GDate1, p借入金マスタ.支払日, _
          '           p借入金マスタ.営業日区分, p借入金マスタ.利息計算日数区分)      '10/02/05
          '      If Format(DateAdd("m", wZ, w返済予定年月), "yyyy/mm/dd") = _
          '          Format(p借入金マスタ.最終返済年月, "yyyy/mm/dd") _
          '          And Format(GDate利息対象年月日, "yyyy/mm/dd") <> _
          '              Format(p借入金マスタ.最終返済実行日, "yyyy/mm/dd") Then '10/02/07
          '          GDate1 = p借入金マスタ.最終返済実行日                       '10/02/07
          '      End If                                                          '10/02/07
          '
          '      GDate2 = MBD010_利息計算年月日(w返済予定年月, p借入金マスタ.支払日, _
          '           p借入金マスタ.営業日区分, p借入金マスタ.利息計算日数区分)      '10/02/05
          '  Else                                                                        '10/02/05
          '      '*利息後払
          '      GDate1 = MBD010_利息計算年月日(w返済予定年月, p借入金マスタ.支払日, _
          '           p借入金マスタ.営業日区分, p借入金マスタ.利息計算日数区分)      '10/02/05
          '      GDate2 = DateAdd("m", -wx, w返済予定年月)                               '10/02/05
          '      GDate2 = MBD010_利息計算年月日(GDate2, p借入金マスタ.支払日, _
          '           p借入金マスタ.営業日区分, p借入金マスタ.利息計算日数区分)      '10/02/05
          '  End If                                                                      '10/02/05
          '  w内入開始年月日 = GDate2                                                    '10/02/05
          '  w内入終了年月日 = GDate1                                                    '10/02/05
          'End If                                                                '10/02/07
          
            '--------------
            '** 日割日数 **
            '--------------
            wTable.日割日数 = 0                                     'V180 07/02/01
            If w返済単位回数 * p借入金マスタ.返済単位月数 <> w返済単位判定 _
                                  And p借入金マスタ.利息支払方法 = 1 Then    '10/01/09                             'V180 07/02/01
            Else                                                    'V180 07/02/01
            
              If p借入金マスタ.利息区分 = XMXA020_区分("利息区分", "利息先払") Then
                '利息先払い
                If p借入金マスタ.利息支払方法 = 0 Then              'V180 07/02/01
                    '利息毎月支払
                    If Format(w返済予定年月, "yyyy/mm/dd") = _
                        Format(p借入金マスタ.最終返済年月, "yyyy/mm/dd") Then   '10/02/10
                        GDate1 = MBD010_利息計算年月日(w返済予定年月, p借入金マスタ.支払日, _
                            p借入金マスタ.営業日区分, p借入金マスタ.利息計算日数区分)   '10/02/10
                        If Format(GDate1, "yyyy/mm/dd") = Format(w実際年月日, "yyyy/mm/dd") Then '10/02/10
                        Else                            '10/02/10
                            GDate1 = w実際年月日        '10/02/10
                        End If                          '10/02/10
                    
                    
                    Else                                '10/02/10
                        GDate1 = DateAdd("m", 1, w返済予定年月)
                        GDate1 = MBD010_利息計算年月日(GDate1, p借入金マスタ.支払日, _
                        p借入金マスタ.営業日区分, p借入金マスタ.利息計算日数区分)  ' 07/01/30 V180
                     
                     
                        '*最終返済日が手打ちの時の調整
                        If Format(DateAdd("m", 1, w返済予定年月), "yyyy/mm/dd") = Format(p借入金マスタ.最終返済年月, "yyyy/mm/dd") _
                           And Format(GDate利息対象年月日, "yyyy/mm/dd") _
                          <> Format(p借入金マスタ.最終返済実行日, "yyyy/mm/dd") Then  '10/02/10
                            GDate1 = p借入金マスタ.最終返済実行日           '10/02/10
                            GDate利息対象年月日 = p借入金マスタ.最終返済実行日   '10/02/10
                        End If                                              '10/02/10
                    End If                                                  '10/02/10
                     
                     
                     
                     
                     
                    'If wRecCount = sv支払回数 - 2 Then                  ' 08/07/19 V188
                    '    If Format(GDate利息対象年月日, "yyyy/mm/dd") <> _
                    '       Format(p借入金マスタ.最終返済実行日, "yyyy/mm/dd") Then      ' 08/07/22 V188
                    '        GDate1 = p借入金マスタ.最終返済実行日                       ' 08/07/19 V188
                    '        GDate利息対象年月日 = p借入金マスタ.最終返済実行日         ' 08/07/19 V188
                    '    End If                                                          ' 08/07/22 V188
                    'End If                                                          ' 08/07/19 V188
                     
                    GDate1利息対象年月日 = GDate利息対象年月日          'V182 2008/01/29
                     
                    GDate2 = MBD010_利息計算年月日(w返済予定年月, p借入金マスタ.支払日, _
                     p借入金マスタ.営業日区分, p借入金マスタ.利息計算日数区分)  ' 07/01/30 V180
                     
                    If wRecCount = 0 Then                                   ' 08/07/19 V188
                        If Format(GDate利息対象年月日, "yyyy/mm/dd") <> _
                           Format(p借入金マスタ.初回返済実行日, "yyyy/mm/dd") Then      ' 08/07/22 V188
                            GDate2 = p借入金マスタ.初回返済実行日                       ' 08/07/19 V188
                            GDate利息対象年月日 = p借入金マスタ.初回返済実行日         ' 08/07/19 V188
                        End If                                                          ' 08/07/22 V188
                    End If                                                              ' 08/07/19 V188
                     
                    wTable.日割日数 = DateDiff("d", GDate2, GDate1)     'V182 2008/01/29
                    w内入開始年月日 = GDate2                            ' 08/12/05 V189
                    w内入終了年月日 = GDate1                            ' 08/12/05 V189
                    
                    GDate2利息対象年月日 = GDate利息対象年月日          'V182 2008/01/29
                    wTable.利息対象期間日数 = wTable.日割日数           '09/12/29
                    w利息対象内入開始年月日 = GDate2利息対象年月日          ' 08/12/08 V189
                    w利息対象内入終了年月日 = GDate1利息対象年月日          ' 08/12/08 V189
                    
                    GDate2 = MBD010_利息計算年月日(p借入金マスタ.最終返済年月, p借入金マスタ.支払日, _
                     p借入金マスタ.営業日区分, p借入金マスタ.利息計算日数区分)  ' 07/01/30 V180
                     
                    If p借入金マスタ.実行日 = p借入金マスタ.初回返済実行日 _
                        And w実際年月日 = p借入金マスタ.実行日 _
                        And (p借入金マスタ.利息控除区分 = 1 Or p借入金マスタ.利息控除区分 = 3) Then '10/05/06 V195
                        wTable.日割日数 = wTable.日割日数 - 1       '10/05/06 V195
                    End If                                          '10/05/06 V195
                    
                     
                    GDate1 = DateAdd("m", 1, w返済予定年月)         'V180 07/02/01
                    If GDate1 = p借入金マスタ.最終返済年月 Then     'V180 07/02/01
                        If p借入金マスタ.利息控除区分 = 2 Or p借入金マスタ.利息控除区分 = 3 Then
                            wTable.日割日数 = wTable.日割日数 - 1   'V180 07/02/01
                        End If                                      'V180 07/02/01
                    End If                    'V180 07/02/01
                    
                    
                Else                                                'V180 07/02/01
                    '利息一括支払
                    If w返済予定年月 = p借入金マスタ.最終返済年月 Then  'V180 07/02/01
                    Else                                            'V180 07/02/01
                        GDate1 = DateAdd("m", p借入金マスタ.返済単位月数, w返済予定年月)     'V180 07/02/01
                        GDate1 = MBD010_利息計算年月日(GDate1, p借入金マスタ.支払日, _
                         p借入金マスタ.営業日区分, p借入金マスタ.利息計算日数区分) ' 07/01/30 V180
                         
                        If wRecCount = sv支払回数 - p借入金マスタ.返済単位月数 - 1 Then ' 08/07/19 V188
                            If Format(GDate利息対象年月日, "yyyy/mm/dd") <> _
                               Format(p借入金マスタ.最終返済実行日, "yyyy/mm/dd") Then      ' 08/07/22 V188
                                GDate1 = p借入金マスタ.最終返済実行日                  ' 08/07/19 V188
                                GDate利息対象年月日 = p借入金マスタ.最終返済実行日    ' 08/07/19 V188
                            End If                                                     ' 08/07/22 V188
                        End If                                                         ' 08/07/19 V188
                         
                        GDate1利息対象年月日 = GDate利息対象年月日          'V182 2008/01/29
                        
                        GDate2 = MBD010_利息計算年月日(w返済予定年月, p借入金マスタ.支払日, _
                         p借入金マスタ.営業日区分, p借入金マスタ.利息計算日数区分) ' 07/01/30 V180
                         
                        If wRecCount = 0 Then                                               ' 08/07/19 V188
                            If Format(GDate利息対象年月日, "yyyy/mm/dd") <> Format(p借入金マスタ.初回返済実行日, "yyyy/mm/dd") Then ' 08/07/19 V188
                                GDate2 = p借入金マスタ.初回返済実行日                       ' 08/07/19 V188
                                GDate利息対象年月日 = p借入金マスタ.初回返済実行日         ' 08/07/19 V188
                            End If                                                          ' 08/07/19 V188
                        End If                                                              ' 08/07/19 V188
                         
                        wTable.日割日数 = DateDiff("d", GDate2, GDate1)                ' 07/01/31 V180
                        w内入開始年月日 = GDate2                            ' 08/12/05 V189
                        w内入終了年月日 = GDate1                            ' 08/12/05 V189
                        
                        GDate2利息対象年月日 = GDate利息対象年月日          'V182 2008/01/29
                        wTable.利息対象期間日数 = wTable.日割日数           '09/12/29
                        w利息対象内入開始年月日 = GDate2利息対象年月日          ' 08/12/08 V189
                        w利息対象内入終了年月日 = GDate1利息対象年月日          ' 08/12/08 V189
                        
                        If p借入金マスタ.実行日 = p借入金マスタ.初回返済実行日 _
                            And w実際年月日 = p借入金マスタ.実行日 _
                            And (p借入金マスタ.利息控除区分 = 1 Or p借入金マスタ.利息控除区分 = 3) Then '10/05/06 V195
                            wTable.日割日数 = wTable.日割日数 - 1           '10/05/06 V195
                        End If                                              '10/05/06 V195
                        
                        
                        GDate1 = DateAdd("m", p借入金マスタ.返済単位月数, w返済予定年月)  'V180 07/02/16
                        If GDate1 = p借入金マスタ.最終返済年月 Then 'V180 07/02/01
                            If p借入金マスタ.利息控除区分 = 2 Or p借入金マスタ.利息控除区分 = 3 Then
                                wTable.日割日数 = wTable.日割日数 - 1   'V180 07/02/01
                            End If                                  'V180 07/02/01
                        End If                                      'V180 07/02/01
                        
                        
                    End If                                          'V180 07/02/01
                End If                                              'V180 07/02/01
                
                If w返済予定年月 = p借入金マスタ.最終返済年月 Then  'V180 07/02/01
                    wTable.日割日数 = 0                             'V180 07/02/01
                    wTable.利息対象期間日数 = 0                     'V182 2008/01/29
                End If                                              'V180 07/02/01
                
                    
              Else                                                  'V189 07/02/01
                '利息後払い
                If p借入金マスタ.利息支払方法 = 0 Then              'V180 07/02/01
                    '利息毎月支払
                    If w返済予定年月 = p借入金マスタ.金利初回年月 Then  'V180 07/02/01
                        GDate1 = MBD010_利息計算年月日(w返済予定年月, p借入金マスタ.支払日, _
                         p借入金マスタ.営業日区分, p借入金マスタ.利息計算日数区分) ' 07/01/30 V180
                         
                        If wRecCount = 0 Then                                         ' 08/07/19 V188
                            If Format(GDate利息対象年月日, "yyyy/mm/dd") <> _
                               Format(p借入金マスタ.初回返済実行日, "yyyy/mm/dd") Then      ' 08/07/22 V188
                                GDate1 = p借入金マスタ.初回返済実行日                 ' 08/07/19 V188
                                GDate利息対象年月日 = p借入金マスタ.初回返済実行日    ' 08/07/19 V188
                            End If                                                    ' 08/07/22 V188
                        End If                                                              ' 08/07/19 V188
                         
                         
                        If p借入金マスタ.実行日 <> p借入金マスタ.初回返済実行日 Then    '10/06/05 V195
                            wTable.日割日数 = DateDiff("d", p借入金マスタ.実行日, GDate1) + 1 'V180 07/02/01
                        Else                                                '10/05/06 V195
                            wTable.日割日数 = DateDiff("d", p借入金マスタ.実行日, GDate1)   '10/05/06 V195
                        End If                                              '10/05/06 V195
                        
                        w内入開始年月日 = p借入金マスタ.実行日              ' 08/12/05 V189
                        w内入終了年月日 = GDate1                            ' 08/12/05 V189
                        
                        GDate1利息対象年月日 = GDate利息対象年月日          'V182 2008/01/29
                        wTable.利息対象期間日数 = wTable.日割日数           '09/12/29
                        w利息対象内入開始年月日 = p借入金マスタ.実行日          ' 08/12/08 V189
                        w利息対象内入終了年月日 = GDate1利息対象年月日          ' 08/12/08 V189
                        If p借入金マスタ.利息控除区分 = 1 Or p借入金マスタ.利息控除区分 = 3 Then
                            wTable.日割日数 = wTable.日割日数 - 1   'V180 07/02/01
                        End If                                      'V180 07/02/01
                        
                        If (Format(p借入金マスタ.金利初回年月, "yyyy/mm/dd") = _
                            Format(p借入金マスタ.初回返済年月, "yyyy/mm/dd")) _
                            And (Format(p借入金マスタ.初回返済年月, "yyyy/mm/dd") = _
                                Format(p借入金マスタ.最終返済年月, "yyyy/mm/dd")) _
                            And (p借入金マスタ.利息控除区分 = 2 Or p借入金マスタ.利息控除区分 = 3) Then        '09/12/31
                            wTable.日割日数 = wTable.日割日数 - 1               '09/12/31
                        End If                                                  '09/12/31
                        
                            
                            
                    Else                                            'V180 07/02/01
                        If w返済予定年月 > p借入金マスタ.金利初回年月 Then  'V180 07/02/01
                            GDate1 = MBD010_利息計算年月日(w返済予定年月, p借入金マスタ.支払日, _
                             p借入金マスタ.営業日区分, p借入金マスタ.利息計算日数区分) ' 07/01/30 V180
                             
                            If wRecCount = 0 Then                                   ' 08/07/19 V188
                                If Format(GDate利息対象年月日, "yyyy/mm/dd") <> _
                                   Format(p借入金マスタ.初回返済実行日, "yyyy/mm/dd") Then      ' 08/07/22 V188
                                    GDate1 = p借入金マスタ.初回返済実行日               ' 08/07/19 V188
                                    GDate利息対象年月日 = p借入金マスタ.初回返済実行日  ' 08/07/19 V188
                                End If                                                  ' 08/07/22 V188
                            Else                                                    ' 08/07/20 V188
                                If wRecCount = sv支払回数 - 1 Then                  ' 08/07/20 V188
                                    If Format(GDate利息対象年月日, "yyyy/mm/dd") <> _
                                       Format(p借入金マスタ.最終返済実行日, "yyyy/mm/dd") Then      ' 08/07/22 V188
                                        GDate1 = p借入金マスタ.最終返済実行日           ' 08/07/19 V188
                                        GDate利息対象年月日 = p借入金マスタ.最終返済実行日  ' 08/07/19 V188
                                    End If                                          ' 08/07/22 V188
                                End If                                              ' 08/07/20 V188
                            End If                                                  ' 08/07/19 V188
                             
                            GDate1利息対象年月日 = GDate利息対象年月日          'V182 2008/01/29
                            
                            GDate2 = DateAdd("m", -1, w返済予定年月)       'V180 07/02/01
                            GDate2 = MBD010_利息計算年月日(GDate2, p借入金マスタ.支払日, _
                             p借入金マスタ.営業日区分, p借入金マスタ.利息計算日数区分)
                             
                            If wRecCount = 1 Then                         ' 08/07/19 V188
                                If Format(GDate利息対象年月日, "yyyy/mm/dd") <> _
                                   Format(p借入金マスタ.初回返済実行日, "yyyy/mm/dd") Then      ' 08/07/22 V188
                                    GDate2 = p借入金マスタ.初回返済実行日                       ' 08/07/19 V188
                                    GDate利息対象年月日 = p借入金マスタ.初回返済実行日          ' 08/07/19 V188
                                End If                                                          ' 08/07/22 v188
                            End If                                                          ' 08/07/19 V188
                             '
                            wTable.日割日数 = DateDiff("d", GDate2, GDate1) 'V180 07/02/01
                            w内入開始年月日 = GDate2                            ' 08/12/05 V189
                            w内入終了年月日 = GDate1                            ' 08/12/05 V189
                            
                            GDate2利息対象年月日 = GDate利息対象年月日          'V182 2008/01/29
                            wTable.利息対象期間日数 = wTable.日割日数           '09/12/29
                            w利息対象内入開始年月日 = GDate2利息対象年月日          ' 08/12/08 V189
                            w利息対象内入終了年月日 = GDate1利息対象年月日          ' 08/12/08 V189
                            If w返済予定年月 = p借入金マスタ.最終返済年月 Then      'V180 07/02/01
                                If p借入金マスタ.利息控除区分 = 2 Or p借入金マスタ.利息控除区分 = 3 Then      'V180 07/02/01
                                    wTable.日割日数 = wTable.日割日数 - 1           'V180 07/02/01
                                End If                                              'V180 07/02/01
                            End If                                                  'V180 07/02/01
                                    
                                
                        End If                                      'V180 07/02/01
                    End If                                          'V180 07/02/01
                    
                Else                                                'V180 07/02/01
                    '利息一括支払
                    If p借入金マスタ.初回返済年月 = p借入金マスタ.最終返済年月 _
                        And Format(w一括支払利息開始年月, "yyyy/mm/dd") = _
                            Format(p借入金マスタ.最終返済年月, "yyyy/mm/dd") Then 'V180 07/02/01
                        If w返済予定年月 = p借入金マスタ.最終返済年月 Then  'V180 07/02/01
                            GDate1 = MBD010_利息計算年月日(w返済予定年月, p借入金マスタ.支払日, _
                             p借入金マスタ.営業日区分, p借入金マスタ.利息計算日数区分)
                             
                            GDate1 = p借入金マスタ.初回返済実行日       ' 08/07/20 V188
                            GDate利息対象年月日 = p借入金マスタ.初回返済実行日  '08/07/20 V188
                            
                            If p借入金マスタ.実行日 <> p借入金マスタ.初回返済実行日 Then    '10/05/06 V195
                                wTable.日割日数 = DateDiff("d", p借入金マスタ.実行日, GDate1) + 1 'V180
                            Else                                                '10/05/06 V195
                                wTable.日割日数 = DateDiff("d", p借入金マスタ.実行日, GDate1)   '10/05/06 V195
                            End If                                              '10/05/06 V195
                            
                            w内入開始年月日 = p借入金マスタ.実行日              ' 08/12/05 V189
                            w内入終了年月日 = GDate1                            ' 08/12/05 V189
                            
                            
                            GDate1利息対象年月日 = GDate利息対象年月日          'V182 2008/01/29
                            wTable.利息対象期間日数 = wTable.日割日数           '09/12/29
                            w利息対象内入開始年月日 = p借入金マスタ.実行日          ' 08/12/08 V189
                            w利息対象内入終了年月日 = GDate1利息対象年月日          ' 08/12/08 V189
                            
                            If p借入金マスタ.利息控除区分 = 1 Or p借入金マスタ.利息控除区分 = 2 Then
                                wTable.日割日数 = wTable.日割日数 - 1   'V180 07/02/01
                            Else                                        'V180 07/02/01
                                If p借入金マスタ.利息控除区分 = 3 Then  'V180 07/02/01
                                    wTable.日割日数 = wTable.日割日数 - 2   'V180 07/02/01
                                End If                                  'V180 07/02/01
                            End If                                      'V180 07/02/01
                        End If                                          'V180 07/02/01
                        
                    Else                                                'V180 07/02/01
                        'If w返済予定年月 = p借入金マスタ.初回返済年月 Then      'V180 07/02/01
                        '    GDate1 = MBD010_利息計算年月日(w返済予定年月, p借入金マスタ.支払日, _
                        '      p借入金マスタ.営業日区分, p借入金マスタ.利息計算日数区分) 'V180
                        '    wTable.日割日数 = DateDiff("d", p借入金マスタ.実行日, GDate1) + 1 'V180
                        '
                        '    GDate1利息対象年月日 = GDate利息対象年月日          'V182 2008/01/29
                        '    wTable.利息対象期間日数 = DateDiff("d", p借入金マスタ.実行日, GDate1利息対象年月日) + 1
                            
                        '    If p借入金マスタ.利息控除区分 = 1 Or p借入金マスタ.利息控除区分 = 3 Then    ' 07/02/17 V180
                        '        wTable.日割日数 = wTable.日割日数 - 1
                        '    End If                                      'V180 07/02/01
                        'Else                                            'V180 07/02/01
                        
                        
                            GDate1 = MBD010_利息計算年月日(w返済予定年月, p借入金マスタ.支払日, _
                                p借入金マスタ.営業日区分, p借入金マスタ.利息計算日数区分) 'V180
                                
                            If wRecCount = 0 Then                                   ' 08/07/19 V188
                                If Format(GDate利息対象年月日, "yyyy/mm/dd") <> _
                                   Format(p借入金マスタ.初回返済実行日, "yyyy/mm/dd") Then      ' 08/07/22 V188
                                    GDate1 = p借入金マスタ.初回返済実行日               ' 08/07/19 V188
                                    GDate利息対象年月日 = p借入金マスタ.初回返済実行日  ' 08/07/19 V188
                                End If                                                  ' 08/07/22 V188
                            Else                                                    ' 08/07/20 V188
                                If wRecCount = (sv支払回数 - 1) Then                ' 08/07/20 V188
                                    If Format(GDate利息対象年月日, "yyyy/mm/dd") <> _
                                       Format(p借入金マスタ.最終返済実行日, "yyyy/mm/dd") Then      ' 08/07/22 V188
                                        GDate1 = p借入金マスタ.最終返済実行日           ' 08/07/20 V188
                                        GDate利息対象年月日 = p借入金マスタ.最終返済実行日  ' 08/07/20 V188
                                    End If                                              ' 08/07/22 V188
                                 End If                                             ' 08/07/20 V188
                            End If                                                  ' 08/07/20 V188
                                 
                            GDate1利息対象年月日 = GDate利息対象年月日          'V182 2008/01/29
                            
                            
                                
                            GDate2 = DateAdd("m", -p借入金マスタ.返済単位月数, w返済予定年月) 'V180
                            GDate2 = MBD010_利息計算年月日(GDate2, p借入金マスタ.支払日, _
                              p借入金マスタ.営業日区分, p借入金マスタ.利息計算日数区分)
                              
                            If wRecCount = 0 And (Format(GDate2, "yyyy/mm/dd") < Format(p借入金マスタ.実行日, "yyyy/mm/dd") _
                              Or Format(w一括支払利息開始年月, "yyyy/mm/dd") = Format(p借入金マスタ.初回返済年月, "yyyy/mm/dd")) _
                               Then ' 2009/12/20                               ' 08/07/19 V188
                                
                                If p借入金マスタ.実行日 <> p借入金マスタ.初回返済実行日 Then    '10/05/06 V195
                                    GDate2 = DateAdd("d", -1, p借入金マスタ.実行日)     ' 08/07/19 V188
                                    GDate利息対象年月日 = DateAdd("d", -1, p借入金マスタ.実行日) ' 08/07/19 V188
                                Else                                                    '10/05/06 V195
                                    GDate2 = p借入金マスタ.実行日       '10/05/06 V195
                                    GDate利息対象年月日 = p借入金マスタ.実行日      '10/05/06 V195
                                End If                                              '10/05/06 V195
                                
                            Else                                                    ' 08/07/20 V188
                                If 0 = (wRecCount - p借入金マスタ.返済単位月数) Then ' 08/07/20 V188
                                    If Format(GDate利息対象年月日, "yyyy/mm/dd") <> _
                                       Format(p借入金マスタ.初回返済実行日, "yyyy/mm/dd") Then      ' 08/07/22 V188
                                        GDate2 = p借入金マスタ.初回返済実行日           ' 08/07/20 V188
                                        GDate利息対象年月日 = p借入金マスタ.初回返済実行日  ' 08/07/20 V188
                                    End If                                          ' 08/07/22 V188
                                End If                                              ' 08/07/20 V188
                            End If
                              
                            wTable.日割日数 = DateDiff("d", GDate2, GDate1) ' 08/07/20 V188
                            w内入開始年月日 = GDate2                            ' 08/12/05 V189
                            w内入終了年月日 = GDate1                            ' 08/12/05 V189
                            
                            GDate2利息対象年月日 = GDate利息対象年月日          'V182 2008/01/29
                            wTable.利息対象期間日数 = wTable.日割日数           '09/12/29
                            w利息対象内入開始年月日 = GDate2利息対象年月日          ' 08/12/08 V189
                            w利息対象内入終了年月日 = GDate1利息対象年月日          ' 08/12/08 V189
                            If w返済予定年月 = p借入金マスタ.最終返済年月 Then  'V180 07/02/01
                                If p借入金マスタ.利息控除区分 = 2 Or p借入金マスタ.利息控除区分 = 3 Then
                                    wTable.日割日数 = wTable.日割日数 - 1   'V180 07/02/01
                                End If                                      'V180 07/02/01
                            End If                                          'V180 07/02/01
                            
                            '***初回返済日　が　金利初回返済日　の時　実行日の控除処理
                            If (wRecCount = 0 And _
                               (Format(p借入金マスタ.初回返済年月, "yyyy/mm/dd") = Format(p借入金マスタ.金利初回年月, "yyyy/mm/dd")) _
                               And (p借入金マスタ.利息控除区分 = 1 Or p借入金マスタ.利息控除区分 = 3)) _
                               Or _
                               (p借入金マスタ.実行日 = p借入金マスタ.初回返済実行日 _
                                And w返済予定年月 = p借入金マスタ.金利初回年月 _
                                And (p借入金マスタ.利息控除区分 = 1 Or p借入金マスタ.利息控除区分 = 3)) Then   '10/05/06 V195
                               wTable.日割日数 = wTable.日割日数 - 1    '09/12/26
                            End If                                      '09/12/26
                            
                        'End If                                              'V180 07/02/01
                        
                        
                    End If                                              'V180 07/02/01
                End If                                                  'V180 07/02/01
                
              End If                                                    'V180 07/02/01
              
            End If                                                      'V180 07/02/01
            
                    
            '** 解約 **
            If Not IsNull(w解約実行日) Then
                If w実際年月日 >= w解約実行日 Then
                    w差月数 = DateDiff("M", OLD実際年月日, NEW実際年月日)           ' 07/03/24 V180
                    If w実際年月日 = w解約実行日 And w差月数 >= 2 And p借入金マスタ.営業日区分 = 0 Then     ' 07/03/24 V180
                        w日割日数 = wTable.日割日数                                 ' 07/03/23 V180
                    End If                                                          ' 07/03/23 V180
                    
                    wTable.元金額 = 0
                    If p借入金マスタ.利息区分 = XMXA020_区分("利息区分", "利息先払") Then
                        '利息先払い
                        If p借入金マスタ.利息支払方法 = 0 Then          'V180 07/02/01
                            '利息毎月支払
                            GDate1 = MBD010_利息計算年月日(w返済予定年月, p借入金マスタ.支払日, _
                              p借入金マスタ.営業日区分, p借入金マスタ.利息計算日数区分)
                              
                            If wRecCount = 0 Then                       ' 08/07/20 V188
                                If Format(GDate利息対象年月日, "yyyy/mm/dd") <> _
                                   Format(p借入金マスタ.初回返済実行日, "yyyy/mm/dd") Then      ' 08/07/22 V188
                                    GDate1 = p借入金マスタ.初回返済実行日   ' 08/07/20 V188
                                    GDate利息対象年月日 = p借入金マスタ.初回返済実行日  ' 08/07/20 V188
                                End If                                  ' 08/07/22 V188
                            End If                                      ' 08/07/20 V188
                            
                            
                            '*最終返済日が手打ちの時の調整
                            If Format(w返済予定年月, "yyyy/mm/dd") = Format(p借入金マスタ.最終返済年月, "yyyy/mm/dd") _
                                And Format(GDate利息対象年月日, "yyyy/mm/dd") _
                                <> Format(p借入金マスタ.最終返済実行日, "yyyy/mm/dd") Then  '10/02/10
                                GDate1 = p借入金マスタ.最終返済実行日           '10/02/10
                                GDate利息対象年月日 = p借入金マスタ.最終返済実行日   '10/02/10
                            End If                                              '10/02/10
                            
                            
                            
                            
                            
                            
                            'If wRecCount = sv支払回数 - 1 Then          ' 08/07/20 V188
                            '    If Format(GDate利息対象年月日, "yyyy/mm/dd") <> _
                            '       Format(p借入金マスタ.最終返済実行日, "yyyy/mm/dd") Then      ' 08/07/22 V188
                            '        GDate1 = p借入金マスタ.最終返済実行日   ' 08/07/20 V188
                            '        GDate利息対象年月日 = p借入金マスタ.最終返済実行日  ' 08/07/20 V188
                            '    End If                                  ' 08/07/22 V188
                            'End If                                      ' 08/07/20 V188
                              
                            wTable.日割日数 = DateDiff("d", w解約実行日, GDate1) * -1  'V180 07/02/01
                            
                            w内入開始年月日 = w解約実行日                   '10/01/30
                            w内入終了年月日 = GDate1                        '10/01/30
                            
                            GDate1利息対象年月日 = GDate利息対象年月日          'V182 2008/01/29
                            wTable.利息対象期間日数 = wTable.日割日数           '09/12/29
                            
                            If w返済予定年月 <> p借入金マスタ.最終返済年月 Then     ' 07/03/06 V180
                                If p借入金マスタ.利息控除区分 = 2 Or p借入金マスタ.利息控除区分 = 3 Then 'V180
                                    wTable.日割日数 = wTable.日割日数 - 1       '2012/03/21
                                End If
                            Else                                                '10/02/07
                                'If p借入金マスタ.利息控除区分 = 2 Or p借入金マスタ.利息控除区分 = 3 Then    '10/02/07
                                '    wTable.日割日数 = wTable.日割日数 + 1       '10/02/07
                                'End If                                          'V180 07/03/05
                            End If                                              ' 07/03/06 V180
                            
                        Else                                            'V180 07/02/01
                            '利息一括支払
                            If p借入金マスタ.初回返済年月 = p借入金マスタ.最終返済年月 Then 'V180
                                GDate1 = MBD010_利息計算年月日(w返済予定年月, p借入金マスタ.支払日, _
                                 p借入金マスタ.営業日区分, p借入金マスタ.利息計算日数区分)
                                 
                                If wRecCount = 0 Then                       ' 08/07/21 V188
                                    If Format(GDate利息対象年月日, "yyyy/mm/dd") <> _
                                       Format(p借入金マスタ.初回返済実行日, "yyyy/mm/dd") Then      ' 08/07/22 V188
                                        GDate1 = p借入金マスタ.初回返済実行日
                                        GDate利息対象年月日 = p借入金マスタ.初回返済実行日 ' 08/07/21 V188
                                    End If                                  ' 08/07/22 V188
                                End If             ' 08/07/21 V188
                                                              
                                If wRecCount >= (sv支払回数 - p借入金マスタ.返済単位月数 + 1 - 1) _
                                   And wRecCount <= (sv支払回数 - 1) Then       ' 08/07/21 V188
                                   If Format(GDate利息対象年月日, "yyyy/mm/dd") <> _
                                      Format(p借入金マスタ.最終返済実行日, "yyyy/mm/dd") Then      ' 08/07/22 V188
                                        GDate1 = p借入金マスタ.最終返済実行日       ' 08/07/21 V188
                                        GDate利息対象年月日 = p借入金マスタ.最終返済実行日  ' 08/07/21 V188
                                   End If                                       ' 08/07/22 V188
                                End If                                          ' 08/07/21 V188
                                
                                    
                                wTable.日割日数 = DateDiff("d", w解約実行日, GDate1) * -1
                                
                                GDate2 = MBD010_利息計算年月日(DateAdd("m", -p借入金マスタ.返済単位月数, p借入金マスタ.最終返済年月), _
                                     p借入金マスタ.支払日, p借入金マスタ.営業日区分, p借入金マスタ.利息計算日数区分)    '10/02/11
                                
                                
                                If Format(GDate2, "yyyy/mm/dd") _
                                          >= Format(w解約実行日, "yyyy/mm/dd") _
                                     Or wTable.日割日数 > 0 Then           ' 10/02/13
                                    If p借入金マスタ.利息控除区分 = 2 Or p借入金マスタ.利息控除区分 = 3 Then '10/02/13
                                        wTable.日割日数 = wTable.日割日数 - 1      '2012/03/21
                                    End If                                          '10/02/13
                                Else                                                '10/02/07
                                    'If p借入金マスタ.利息控除区分 = 2 Or p借入金マスタ.利息控除区分 = 3 Then    '10/02/07
                                    '    wTable.日割日数 = wTable.日割日数 + 1       '10/02/07
                                    'End If                                          '10/02/07
                                End If                                              ' 10/02/13
                                 
                                
                                'If p借入金マスタ.利息控除区分 = 2 Or p借入金マスタ.利息控除区分 = 3 Then    '10/02/13
                                '    wTable.日割日数 = wTable.日割日数 + 1               '10/02/13
                                'End If                                                  '10/02/13
                                
                                
                                w内入開始年月日 = w解約実行日                   '10/01/30
                                w内入終了年月日 = GDate1                        '10/01/30
                                
                                GDate1利息対象年月日 = GDate利息対象年月日          'V182 2008/01/29
                                wTable.利息対象期間日数 = wTable.日割日数           '09/12/29
                                
                            Else                                        'V180 07/02/01
                                w調整月数 = (wTable.返済回数 - 1) Mod p借入金マスタ.返済単位月数 'V180
                                If w調整月数 = 0 Then                               'V180 07/02/01
                                Else                                                'V180 07/02/01
                                    w調整月数 = p借入金マスタ.返済単位月数 - w調整月数  'V180 07/02/01
                                End If                                              'V180 07/02/01
                                    
                                GDate1 = DateAdd("m", w調整月数, w返済予定年月)     'V180 07/02/01
                                GDate1 = MBD010_利息計算年月日(GDate1, p借入金マスタ.支払日, _
                                   p借入金マスタ.営業日区分, p借入金マスタ.利息計算日数区分)
                                     
                                If wRecCount = 0 Then                       ' 08/07/21 V188
                                    If Format(GDate利息対象年月日, "yyyy/mm/dd") <> _
                                           Format(p借入金マスタ.初回返済実行日, "yyyy/mm/dd") Then  ' 08/07/22 V188
                                            GDate1 = p借入金マスタ.初回返済実行日
                                            GDate利息対象年月日 = p借入金マスタ.初回返済実行日 ' 08/07/21 V188
                                    End If                                  ' 08/07/22 V188
                                End If             ' 08/07/21 V188
                                                              
                                If wRecCount >= (sv支払回数 - p借入金マスタ.返済単位月数 + 1 - 1) _
                                        And wRecCount <= (sv支払回数 - 1) Then       ' 08/07/21 V188
                                    If Format(GDate利息対象年月日, "yyyy/mm/dd") <> _
                                        Format(p借入金マスタ.最終返済実行日, "yyyy/mm/dd") Then      ' 08/07/22 V188
                                        GDate1 = p借入金マスタ.最終返済実行日       ' 08/07/21 V188
                                        GDate利息対象年月日 = p借入金マスタ.最終返済実行日  ' 08/07/21 V188
                                    End If                                      ' 08/07/2 V188
                                End If                                          ' 08/07/21 V188
                                    
                                wTable.日割日数 = DateDiff("d", w解約実行日, GDate1) * -1 'V180
                                    
                                w内入開始年月日 = w解約実行日                   '10/01/30
                                w内入終了年月日 = GDate1                        '10/01/30
                                    
                                GDate1利息対象年月日 = GDate利息対象年月日          'V182 2008/01/29
                                wTable.利息対象期間日数 = wTable.日割日数           '09/12/29
                                    
                                    
                                GDate2 = MBD010_利息計算年月日(DateAdd("m", -p借入金マスタ.返済単位月数, p借入金マスタ.最終返済年月), _
                                     p借入金マスタ.支払日, p借入金マスタ.営業日区分, p借入金マスタ.利息計算日数区分)    '10/02/11
                                    
                                    
                                If Format(GDate2, "yyyy/mm/dd") _
                                          >= Format(w解約実行日, "yyyy/mm/dd") _
                                     Or wTable.日割日数 > 0 Then           ' 10/02/11
                                    If p借入金マスタ.利息控除区分 = 2 Or p借入金マスタ.利息控除区分 = 3 Then 'V180
                                        wTable.日割日数 = wTable.日割日数 - 1       '2012/03/21
                                    End If                                          'V180 07/03/06
                                Else                                                '10/02/07
                                    'If p借入金マスタ.利息控除区分 = 2 Or p借入金マスタ.利息控除区分 = 3 Then    '10/02/07
                                    '    wTable.日割日数 = wTable.日割日数 + 1       '10/02/07
                                    'End If                                          '10/02/07
                                End If                                              ' 07/03/06 V180
                                
                            
                            End If                                      'V180 07/02/01
                        End If                                          'V180 07/02/01
                        
                        'If p借入金マスタ.利息控除区分 = 2 Or p借入金マスタ.利息控除区分 = 3 Then 'V180
                        '   wTable.日割日数 = wTable.日割日数 - 1       'V180 07/02/01
                        'End If                                          'V180 07/02/01
                        
                    Else                                                'V180 07/02/01
                        '利息後払い
                        If p借入金マスタ.利息支払方法 = 0 Then          'V180 07/02/01
                            '利息毎月支払
                            If w返済予定年月 <= p借入金マスタ.金利初回年月 Then  'V180 07/02/01
                                If p借入金マスタ.実行日 <> p借入金マスタ.初回返済実行日 Then    '10/05/06 V195
                                    wTable.日割日数 = DateDiff("d", p借入金マスタ.実行日, w解約実行日) + 1
                                Else                                    '10/05/06 V195
                                    wTable.日割日数 = DateDiff("d", p借入金マスタ.実行日, w解約実行日)  '10/05/06 V195
                                End If                                  '10/05/06 V195
                                
                                w内入開始年月日 = p借入金マスタ.実行日          '10/01/30
                                w内入終了年月日 = w解約実行日                   '10/01/30
                                
                                wTable.利息対象期間日数 = wTable.日割日数           '09/12/29
                                
                                If p借入金マスタ.利息控除区分 = 1 Or p借入金マスタ.利息控除区分 = 2 Then
                                    wTable.日割日数 = wTable.日割日数 - 1
                                Else                                    'V180 07/02/01
                                    If p借入金マスタ.利息控除区分 = 3 Then      'V180 07/02/01
                                        wTable.日割日数 = wTable.日割日数 - 2   'V180 07/02/01
                                    End If                                      'V180 07/02/01
                                End If                                          'V180 07/02/01
                            Else                                        'V180 07/02/01
                                GDate2 = DateAdd("m", -1, w返済予定年月)        'V180 07/02/01
                                GDate2 = MBD010_利息計算年月日(GDate2, p借入金マスタ.支払日, _
                                     p借入金マスタ.営業日区分, p借入金マスタ.利息計算日数区分)
                                     
                                If wRecCount = 1 Then                         ' 08/07/19 V188
                                    If Format(GDate利息対象年月日, "yyyy/mm/dd") <> _
                                       Format(p借入金マスタ.初回返済実行日, "yyyy/mm/dd") Then      ' 08/07/22 V188
                                        GDate2 = p借入金マスタ.初回返済実行日               ' 08/07/19 V188
                                        GDate利息対象年月日 = p借入金マスタ.初回返済実行日  ' 08/07/19 V188
                                    End If                                              ' 08/07/22 V188
                                End If                                                  ' 08/07/19 V188
                                     
                                wTable.日割日数 = DateDiff("d", GDate2, w解約実行日)    'V180 07/02/01
                                
                                w内入開始年月日 = GDate2                        '10/01/30
                                w内入終了年月日 = w解約実行日                   '10/01/30
                                
                                GDate2利息対象年月日 = GDate利息対象年月日          'V182 2008/01/29
                                wTable.利息対象期間日数 = wTable.日割日数           '09/12/29
                                
                                If p借入金マスタ.利息控除区分 = 2 Or p借入金マスタ.利息控除区分 = 3 Then
                                    wTable.日割日数 = wTable.日割日数 - 1       'V180 07/02/01
                                End If                                          'V180 07/02/01
                            End If                                              'V180 07/02/01
                        Else                                                    'V180 07/02/01
                            '利息一括支払
                            w調整月数 = (wTable.返済回数 - 1) Mod p借入金マスタ.返済単位月数 'V180
                            If w調整月数 = 0 Then                               'V180 07/02/01
                                w調整月数 = p借入金マスタ.返済単位月数          'V180 07/02/01
                            End If
                            
                            GDate1 = DateAdd("m", -w調整月数, w返済予定年月)     'V180 07/02/01
                            
                            GDate1 = MBD010_利息計算年月日(GDate1, p借入金マスタ.支払日, _
                                     p借入金マスタ.営業日区分, p借入金マスタ.利息計算日数区分)
                                     
                            '***初回返済以降の最終期間で解約　20009/12/20
                            w年月日 = MBD010_利息計算年月日(w一括支払利息開始年月, p借入金マスタ.支払日 _
                                        , p借入金マスタ.営業日区分, p借入金マスタ.金利計算年間日数) '09/12/10
                                        
                            If wRecCount = 0 And Format(w解約実行日, "yyyy/mm/dd") _
                                            <= Format(w年月日, "yyyy/mm/dd") Then    '10/01/24
                                If p借入金マスタ.実行日 <> p借入金マスタ.初回返済実行日 Then    '10/05/06 V195
                                    GDate1 = DateAdd("d", -1, p借入金マスタ.実行日) ' 08/07/21 V188
                                    GDate利息対象年月日 = DateAdd("d", -1, p借入金マスタ.実行日) ' 08/07/21 V188
                                Else                                '10/05/06 V195
                                    GDate1 = p借入金マスタ.実行日   '10/05/06 V195
                                    GDate利息対象年月日 = p借入金マスタ.実行日  '10/05/06 V195
                                End If                              '10/05/06 V195
                                
                            End If                                  ' 08/07/21 V188
                            
                            If wRecCount >= (2 - 1) _
                                And wRecCount <= (2 + p借入金マスタ.返済単位月数 - 1 - 1) Then ' 08/07/21 V188
                                If Format(GDate利息対象年月日, "yyyy/mm/dd") <> _
                                   Format(p借入金マスタ.初回返済実行日, "yyyy/mm/dd") Then      ' 08/07/22 V188
                                    GDate1 = p借入金マスタ.初回返済実行日       ' 08/07/21 V188
                                    GDate利息対象年月日 = p借入金マスタ.初回返済実行日  ' 08/07/21 V188
                                End If                                      ' 08/07/22 V188
                            End If                                          ' 08/07/21 V188
                            
                                
                            
                                     
                            wTable.日割日数 = DateDiff("d", GDate1, w解約実行日) 'V180 07/02/01
                            
                            w内入開始年月日 = GDate1                        '10/01/30
                            w内入終了年月日 = w解約実行日                   '10/01/30
                            
                            GDate1利息対象年月日 = GDate利息対象年月日          'V182 2008/01/29
                            wTable.利息対象期間日数 = wTable.日割日数           '09/12/29
                            
                            
                            If ((p借入金マスタ.実行日 = p借入金マスタ.初回返済実行日 _
                                And GDate1 = p借入金マスタ.実行日) _
                                Or _
                                (p借入金マスタ.実行日 <> p借入金マスタ.初回返済実行日 _
                                 And DateAdd("D", 1, GDate1) = p借入金マスタ.実行日)) _
                                And _
                                (p借入金マスタ.利息控除区分 = 1 Or p借入金マスタ.利息控除区分 = 3) Then '10/05/06 V195
                                wTable.日割日数 = wTable.日割日数 - 1       '10/05/06 V195
                            End If                                          '10/05/06 V195
                            
                            If p借入金マスタ.利息控除区分 = 2 Or p借入金マスタ.利息控除区分 = 3 Then
                                wTable.日割日数 = wTable.日割日数 - 1           'V180 07/02/01
                            End If                                              'V180 07/02/01
                        End If                                                  'V180 07/02/01
                        
                    End If                                                      'V180 07/02/01
                    
                    'wTable.日割日数 = wTable.日割日数 + w日割日数               ' 08/07/25 V188DEL
                    'wTable.利息対象期間日数 = wTable.利息対象期間日数 + w日割日数 08/07/25 V188DEL
                    
                Else                                                            ' 07/03/25 V180
                    w日割日数 = 0                                               ' 07/03/23 V180
                    
                End If
            End If
           
            '--------------
            '** 利息計算 **
            '--------------
            If p借入金マスタ.利息区分 = XMXA020_区分("利息区分", "利息後払") Then   ' 08/12/06 V189
                Call MBD010_内入処理(p借入金マスタ)                                 ' 08/12/06 V189
            End If                                                                  ' 08/12/06 V189
            
            '*** プロジェクト管理で　過去,未来　共に　元金額を＝０と見なす（内入のみ計算対象とする)
            'If p借入金マスタ.プロジェクト番号 > "" Then     ' 09/03/01 V189
            '    'Format(w本日年月日, "yyyy/mm/dd") > Format(wTable.実際年月日, "yyyy/mm/dd") Then ' 08/12/06 V189
            '    wTable.元金額 = 0                               ' 08/12/06 V189
            'End If                                              ' 08/12/06 V189
            
            
            '***
            w融資残高 = w融資残高 - wTable.元金額
            wTable.融資残高 = w融資残高
            
            
            
            '** 解約の時　解約実行日を、実際年月日にセット **
            If Not IsNull(w解約実行日) And wTable.実際年月日 >= w解約実行日 Then   '解約
                wTable.実際年月日 = w解約実行日
            End If
              
            '***解約日調整＆利息計算年月日　のセット　（初回返済年月以降）
            If Not IsNull(w解約実行日) And _
                Format(wTable.実際年月日, "yyyy/mm/dd") = Format(w解約実行日, "yyyy/mm/dd") Then '10/01/04
                wTable.利息計算年月日 = w解約実行日                 '10/01/04
            Else                                                    '10/01/04
                wTable.利息計算年月日 = MBD010_利息計算年月日(wTable.返済予定年月, p借入金マスタ.支払日, _
                         p借入金マスタ.営業日区分, p借入金マスタ.利息計算日数区分) '10/01/04
                '***初回返済年月日　手打ち
                If Format(wTable.返済予定年月, "yyyy/mm/dd") = Format(p借入金マスタ.初回返済年月, "yyyy/mm/dd") _
                    And Format(GDate利息対象年月日, "yyyy/mm/dd") <> _
                        Format(p借入金マスタ.初回返済実行日, "yyyy/mm/dd") Then  '10/01/04
                    wTable.利息計算年月日 = p借入金マスタ.初回返済実行日        '10/01/04
                Else                                                            '10/01/04
                    If Format(wTable.返済予定年月, "yyyy/mm/dd") = Format(p借入金マスタ.最終返済年月, "yyyy/mm/dd") _
                        And Format(GDate利息対象年月日, "yyyy/mm/dd") <> _
                            Format(p借入金マスタ.最終返済実行日, "yyyy/mm/dd") Then  '10/01/04
                        wTable.利息計算年月日 = p借入金マスタ.最終返済実行日        '10/01/04
                    End If                                                      '10/01/04
                End If                                                          '10/01/04
            End If                                                              '10/01/04
            
            '*** 変動金利　設定
            If p借入金マスタ.利息区分 = XMXA020_区分("利息区分", "利息先払") Then   ' 08/012/10 V189
                If Not IsNull(w解約実行日) And _
                    Format(wTable.実際年月日, "yyyy/mm/dd") = Format(w解約実行日, "yyyy/mm/dd") Then
                    w利息計算基準年月日 = DateAdd("d", -1, wTable.利息計算年月日)   '10/01/23
                Else                                                                '10/01/23
                    w利息計算基準年月日 = wTable.利息計算年月日                     '10/01/23
                End If                                                              '10/01/23
                
            Else                                                                ' 08/12/10 V189
                w利息計算基準年月日 = DateAdd("d", -wTable.利息対象期間日数, wTable.利息計算年月日) '10/01/04
            End If                                                              ' 08/12/10 V189
            wTable.利率 = MBD010_金利参照(p借入金マスタ, w利息計算基準年月日)   ' 08/12/10 V189
            
            If p借入金マスタ.実行日 = p借入金マスタ.初回返済実行日 _
                And p借入金マスタ.実行日 = w利息計算基準年月日 _
                And wTable.利息対象期間日数 = 0 Then                            '10/05/06 V195
                wTable.利率 = p借入金マスタ.利率                                '10/05/06 V195
            End If                                                              '10/05/06 V195
            
            
            If p借入金マスタ.利息区分 = XMXA020_区分("利息区分", "利息先払") Then
                '利息先払い
                'If p借入金マスタ.金利計算年間日数 = 0 Then                  'V180 07/02/01
                '    wTable.利息額 = Fix(wTable.融資残高 * CCur(wTable.利率) * wTable.日割日数 / 36500)
                'Else                                                            'V180 07/02/01
                '    wTable.利息額 = Fix(wTable.融資残高 * CCur(wTable.利率) * wTable.日割日数 / 36000)
                'End If                                                          'V180 07/02/01
                wTable.利息額 = MBD010_利息計算小数点5桁(wTable.利率, p借入金マスタ.融資残高, _
                                    wTable.日割日数, p借入金マスタ.金利計算年間日数) '10/06/15
            
                
            Else
                '利息後払い
                'If p借入金マスタ.金利計算年間日数 = 0 Then                  'V180 07/02/01
                '    wTable.利息額 = Fix((wTable.融資残高 + wTable.元金額) * CCur(wTable.利率) * wTable.日割日数 / 36500)   '利息後払い
                'Else
                '    wTable.利息額 = Fix((wTable.融資残高 + wTable.元金額) * CCur(wTable.利率) * wTable.日割日数 / 36000)   '利息後払い
                'End If
                wTable.利息額 = MBD010_利息計算小数点5桁(wTable.利率, wTable.融資残高 + wTable.元金額, _
                                    wTable.日割日数, p借入金マスタ.金利計算年間日数) '10/06/15
                
            End If
            wTable.返済金額 = wTable.利息額 + wTable.元金額
                     
            '** 解約の時　解約実行日を、実際年月日にセット **
            'If Not IsNull(w解約実行日) And wTable.実際年月日 >= w解約実行日 Then   '解約
            '    wTable.実際年月日 = w解約実行日
            'End If
            
        wTable.据置x回目 = 2                                    ' 09/01/16 V189
        Call MBD010_借入金テーブルWrite(wTable)
        
        If p借入金マスタ.利息区分 = XMXA020_区分("利息区分", "利息先払") Then   ' 08/12/06 V189
            Call MBD010_内入処理(p借入金マスタ)                                 ' 08/12/06 V189
        End If                                                                  ' 08/12/06 V189
        
    Next
            
    ' -----------------------------------------
    '                保証料算出
    ' -----------------------------------------
    w解約保証料戻 = 0
    
    If p借入金マスタ.保証料率 <> 0 Then
    
        w保証料支払日 = 18

        wRet保証料算出 = MBD010_保証料算出(p借入金マスタ.借入番号, _
                                          p借入金マスタ.自己資金フラグ, _
                                          p借入金マスタ.有担保フラグ, _
                                          p借入金マスタ.保証料分割フラグ, _
                                          p借入金マスタ.保証料率, _
                                          p借入金マスタ.融資金額, _
                                          p借入金マスタ.実行日, _
                                          w解約実行日, _
                                          p借入金マスタ.初回返済実行日, _
                                          p借入金マスタ.最終返済実行日, _
                                          p借入金マスタ.初回返済年月, _
                                          p借入金マスタ.最終返済年月, _
                                          p借入金マスタ.支払回数, _
                                          p借入金マスタ.据置回数, _
                                          w実行支払年月, _
                                          p借入金マスタ.営業日区分 _
                                          )
        
        w解約保証料戻 = wRet保証料算出.解約保証料戻
         
         
        '保証料通常登録
        wTable.借入番号 = p借入金マスタ.借入番号
        wTable.返済回数 = 0
        wTable.据置x回目 = 5                    ' 08/12/16 V189
        'wTable.返済予定年月 = p借入金マスタ.実行日
        wTable.実際年月日 = p借入金マスタ.実行日
        wTable.元金額 = 0                       ' 08/12/14 V189
        
        wTable = MBD010_借入金テーブルRead(wTable)
        '    wTable.金融保証料 = wRet保証料算出.初回保証料
            wTable.保証料 = wRet保証料算出.初回保証料
        Call MBD010_借入金テーブルWrite(wTable)
   
        '保証料通常登録(分割時)
                    
        For wCount = 1 To 9  'X年後
            If wRet保証料算出.保証料X年後(wCount) <> 0 Then
                    
                w返済予定年月 = DateSerial((Year(p借入金マスタ.実行日) + wCount), Month(p借入金マスタ.実行日), 1)
                w実際予定年月日 = MXA030_翌営業年月日計算(w返済予定年月, w保証料支払日, p借入金マスタ.営業日区分) ' 07/01/30 V180
                GDate1 = MXA030_翌営業年月日計算(w返済予定年月, w保証料支払日, p借入金マスタ.営業日区分) ' 07/01/30 V180
            '    w実際予定年月日 = DateSerial((Year(p借入金マスタ.実行日) + wCount), Month(p借入金マスタ.実行日), w保証料支払日)　2003/7/3
            '    GDate1 = DateSerial(Year(w返済予定年月), Month(w返済予定年月), w保証料支払日) '2003/7/3
             
                If w解約実行日 > GDate1 _
                Or IsNull(w解約実行日) Then
        
                    wTable.借入番号 = p借入金マスタ.借入番号
                    wTable.返済回数 = 0
                    wTable.据置x回目 = 5
                    wTable.返済予定年月 = w返済予定年月
                      
                    wTable = MBD010_借入金テーブルRead(wTable)
                        wTable.保証料 = wRet保証料算出.保証料X年後(wCount)
                    '    wTable.金融保証料 = wRet保証料算出.保証料X年後(wCount)
                        wTable.実際年月日 = w実際予定年月日
                        wTable.返済予定年月 = w返済予定年月
                        wTable.元金額 = 0
                        wTable.日割日数 = 0
                        wTable.利息対象期間日数 = 0 'V182 2008/01/29
                        wTable.返済金額 = 0
                        wTable.融資残高 = 0
                        wTable.利息額 = 0
                        wTable.利率 = 0
                         
                    Call MBD010_借入金テーブルWrite(wTable)
                End If
            End If
        Next
   
        '解約保証料戻
        If w解約保証料戻 <> 0 Then
            wTable.借入番号 = p借入金マスタ.借入番号
            wTable.返済回数 = 0
            wTable.据置x回目 = 5
            wTable.返済予定年月 = w解約実行日
            wTable.実際年月日 = w解約実行日
            
            wTable = MBD010_借入金テーブルRead(wTable)
                wTable.保証料 = w解約保証料戻
            '    wTable.金融保証料 = -1 * w解約保証料戻
                wTable.実際年月日 = w解約実行日
               
            Call MBD010_借入金テーブルWrite(wTable)
        End If
        
    End If
      
    MBD030_借入金テーブル作成 = w解約保証料戻
    
    Call MBD010_融資残高再計算(p借入金マスタ, w解約実行日)      ' 08/12/24 V189
'
    Exit Function
'
'----------< ERROR ROUTINE >---------------------------------------------------
MBD030_借入金テーブル作成_ERR:
    pERR_MES = pPROGRAM_ID + "/ MBD030_借入金テーブル作成() でエラー" + vbCrLf + vbCrLf + _
                "エラー番号　　：" + CStr(Err.Number) + vbCrLf + _
                "プロジェクト名：" + Err.Source + vbCrLf + _
                "エラー内容　　：" + Err.Description + vbCrLf + vbCrLf + _
                GProduct + "を終了します"
    pERR_RET = MsgBox(pERR_MES, vbOKOnly + vbCritical, pMSGBOX_TYTLE)
    pERR_RET = PUT_LOG(pERR_MES)

    End
'
End Function

'------------------------------------------------
' MBD030_借入金時価評価明細表
'------------------------------------------------
Public Sub MBD030_借入金時価評価明細表(p金融リストラ番号 As String, p借入計画マスタ As MAA910_借入金)
'
    Dim wRs As ADODB.Recordset
    Dim wstr As String

    Dim j As Integer
    Dim w解約実行日 As Variant      ' 07/02/21 V180
    Dim w返済回数 As Integer        '10/02/27
'
    On Error GoTo MBD030_借入金時価評価明細表_ERR
'
    w返済回数 = 0                   '10/02/27
'
    wstr = ""
    wstr = wstr + "Select * From DCDA010_借入金現在価値明細"
    Call AdoRecordsetOpen(GDb, wRs, wstr)
        For j = 1 To UBound(G借入金テーブル)
          If G借入金テーブル(j).元金額 <> 0 Or G借入金テーブル(j).利息額 <> 0 _
             Or (G借入金テーブル(j).融資残高 <> 0 And p借入計画マスタ.実行日 = G借入金テーブル(j).実際年月日) _
             Or G借入金テーブル(j).保証料 <> 0 Or G借入金テーブル(j).手数料 <> 0 _
             Or Format(w解約実行日, "yyyymmdd") = _
                   Format(G借入金テーブル(j).実際年月日, "yyyymmdd") Then '10/06/16 V195
             
            wRs.AddNew
        
                wRs("借入番号") = G借入金テーブル(j).借入番号
                If (Format(p借入計画マスタ.実行日, "yyyy/mm/dd") _
                        <> Format(G借入金テーブル(j).実際年月日, "yyyy/mm/dd")) _
                   Or (p借入計画マスタ.実行日 = G借入金テーブル(j).実際年月日 _
                       And p借入計画マスタ.実行日 = p借入計画マスタ.初回返済実行日) Then  '10/05/06 V195
                    w返済回数 = w返済回数 + 1                   '10/02/27
                    wRs("返済回数") = w返済回数                 '10/02/27
                Else                                            '10/02/27
                    wRs("返済回数") = 0                         '10/02/27
                End If                                          '10/02/27
                'wRs("返済回数") = G借入金テーブル(j).返済回数
                wRs("据置X回目") = G借入金テーブル(j).据置x回目
                wRs("返済予定年月") = G借入金テーブル(j).返済予定年月
    
                wRs("実際年月日") = G借入金テーブル(j).実際年月日
                wRs("利息計算年月日") = G借入金テーブル(j).利息計算年月日   '10/01/04
                wRs("利息額") = G借入金テーブル(j).利息額
                wRs("保証料") = G借入金テーブル(j).保証料
                wRs("手数料") = G借入金テーブル(j).手数料       ' 08/12/06 V189
                wRs("金融保証料") = G借入金テーブル(j).金融保証料
                
                '解約算出
                If p金融リストラ番号 > "" _
                   And p金融リストラ番号 = p借入計画マスタ.金融リストラ番号 Then  ' 07/02/18 V180
                    w解約実行日 = p借入計画マスタ.金融解約実行日
                Else
                    w解約実行日 = p借入計画マスタ.解約実行日
                End If
                
                If Format(w解約実行日, "yyyymmdd") = _
                   Format(G借入金テーブル(j).実際年月日, "yyyymmdd") Then   ' 07/02/21 V180
                    wRs("返済金額") = G借入金テーブル(j).融資残高 + G借入金テーブル(j).利息額
                    wRs("元金額") = G借入金テーブル(j).融資残高             ' 07/02/21 V180
                    wRs("融資残高") = 0                                     ' 07/02/21 V180
                Else                                                        ' 07/02/21 V180
                    wRs("返済金額") = G借入金テーブル(j).返済金額
                    wRs("元金額") = G借入金テーブル(j).元金額
                    wRs("融資残高") = G借入金テーブル(j).融資残高
                End If                                                      ' 07/02/21 V180
                    
                'wRs("日割日数") = G借入金テーブル(j).日割日数                      '2015/06/01 V430
                wRs("利息対象期間日数") = G借入金テーブル(j).利息対象期間日数       'V182 2008/01/28
                wRs("利率") = G借入金テーブル(j).利率
                
                '2015/06/01 V430 時価評価
                wRs("決算年月日") = G借入金テーブル(j).決算年月日
                wRs("時価評価金利") = G借入金テーブル(j).時価評価金利
                wRs("返済年月日") = G借入金テーブル(j).返済年月日
                wRs("MA日割日数") = G借入金テーブル(j).MA日割日数
                wRs("指数") = G借入金テーブル(j).指数
                wRs("分母") = G借入金テーブル(j).分母
                wRs("現在価値") = G借入金テーブル(j).現在価値
                wRs("差額") = G借入金テーブル(j).差額
            
            wRs.Update
          
          End If                    '10/02/27
          
        Next
    wRs.Close
    Set wRs = Nothing
'
    Exit Sub
'
'----------< ERROR ROUTINE >---------------------------------------------------
MBD030_借入金時価評価明細表_ERR:
    pERR_MES = pPROGRAM_ID + "/ MBD030_借入金時価評価明細表() でエラー" + vbCrLf + vbCrLf + _
                "エラー番号　　：" + CStr(Err.Number) + vbCrLf + _
                "プロジェクト名：" + Err.Source + vbCrLf + _
                "エラー内容　　：" + Err.Description + vbCrLf + vbCrLf + _
                GProduct + "を終了します"
    pERR_RET = MsgBox(pERR_MES, vbOKOnly + vbCritical, pMSGBOX_TYTLE)
    pERR_RET = PUT_LOG(pERR_MES)

    End
'
End Sub


